Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_hw.h
/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */

/*
 *  Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
 */

#ifndef	_MCXNEX_HW_H
#define	_MCXNEX_HW_H

/*
 * mcxnex_hw.h
 *    Contains all the structure definitions and #defines for all Mcxnex
 *    hardware resources and registers (as defined by the Mcxnex register
 *    specification).  Wherever possible, the names in the Mcxnex spec
 *    have been preserved in the structure and field names below.
 */

#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>

#ifdef __cplusplus
extern "C" {
#endif


/*
 * PCI IDs for supported chipsets
 */
#define	PCI_VENID_MLX		0x15b3
#define	PCI_DEVID_MCXNEX_SDR	0x6340	/* Mellanox MT25208-SDR PCIe Gen1 */
#define	PCI_DEVID_MCXNEX_DDR	0x634A	/* Mellanox MT25208-DDR PCIe Gen1 */
#define	PCI_DEVID_MCXNEX_EN10G  0x6368  /* Mellanox MT25448 PCIe 10G ETH  */
#define	PCI_DEVID_MCXNEX_DDRG2	0x6732	/* Mellanox MT25208-DDR PCIe Gen2 */
#define	PCI_DEVID_MCXNEX_QDRG2	0x673C	/* Mellanox MT25208-QDR PCIe Gen2 */
#define	PCI_DEVID_MCXNEX_CX2	0x6750	/* XXX: Some value.... */
#define	PCI_DEVID_MCXNEX_ENVIRT 0x6764
#define	PCI_DEVID_MCXNEX_MAINT	0x0191  /* Maintenance/Mem Controller Mode */

/*
 * Native page size of the adapter
 */
#define	MCXNEX_PAGESIZE		0x1000	/* 4Kb */
#define	MCXNEX_PAGEMASK		(MCXNEX_PAGESIZE - 1)
#define	MCXNEX_PAGESHIFT	0xC		/* 12  */

/*
 * MACROS to make some page stuff easier
 */

/* given a value, return a value that's the next higher power of 2 */
#define	MCXNEX_POW2(x)		(1 << highbit(x))
/*
 * given a size in bytes, return the minimum number of
 * *HCA PAGES* needed to hold it
 */
#define	MCXNEX_HCA_PAGES(x)	\
	(((x + MCXNEX_PAGESIZE) & MCXNEX_PAGEMASK) >> MCXNEX_PAGESHIFT)

/*
 * given a size in bytes, return the power of two number of
 * *HCA PAGES* needed to hold it
 */
#define	MCXNEX_HCA_POW2_PAGES(x)	(MCXNEX_POW2(MCXNEX_HCA_PAGES(x)))
/*
 * Offsets into the CMD BAR (BAR 0) for many of the more interesting hardware
 * registers.  These registers include the HCR (more below), and the software
 * reset register (SW_RESET).
 */
#define	MCXNEX_CMD_HCR_OFFSET		0x80680 /* PRM */
#define	MCXNEX_CMD_SW_RESET_OFFSET	0xF0010 /* PRM */
#define	MCXNEX_CMD_SW_SEMAPHORE_OFFSET	0xF03FC /* PRM */
#define	MCXNEX_CMD_OFFSET_MASK		0xFFFFF /* per MLX instruction */


/*
 * Ownership flags used to define hardware or software ownership for
 * various Mcxnex resources
 */
#define	MCXNEX_HW_OWNER			0x1
#define	MCXNEX_SW_OWNER			0x0

/*
 * Determines whether or not virtual-to-physical address translation is
 * required.  Several of the Mcxnex hardware structures can be optionally
 * accessed by Mcxnex without going through the TPT address translation
 * tables.
 */
#define	MCXNEX_VA2PA_XLAT_ENABLED	0x1
#define	MCXNEX_VA2PA_XLAT_DISABLED	0x0

/*
 * HCA Command Register (HCR)
 *    The HCR command interface provides privileged access to the HCA in
 *    order to query, configure and modify HCA execution.  It is the
 *    primary mechanism through which mailboxes may be posted to Mcxnex
 *    firmware.  To use this interface software fills the HCR with pointers
 *    to input and output mailboxes.  Some commands support immediate
 *    parameters, however, and for these commands the HCR will contain the
 *    input or output parameters. Command execution completion can be
 *    detected either by the software polling the HCR or by waiting for a
 *    command completion event.
 */
struct mcxnex_hw_hcr_s {
	uint32_t	in_param0;
	uint32_t	in_param1;
	uint32_t	input_modifier;
	uint32_t	out_param0;
	uint32_t	out_param1;
	uint32_t	token;
	uint32_t	cmd;
};
#define	MCXNEX_HCR_TOKEN_MASK		0xFFFF0000
#define	MCXNEX_HCR_TOKEN_SHIFT		16

#define	MCXNEX_HCR_CMD_STATUS_MASK	0xFF000000
#define	MCXNEX_HCR_CMD_GO_MASK		0x00800000
#define	MCXNEX_HCR_CMD_E_MASK		0x00400000
#define	MCXNEX_HCR_CMD_T_MASK		0x00200000
#define	MCXNEX_HCR_CMD_OPMOD_MASK	0x0000F000
#define	MCXNEX_HCR_CMD_OPCODE_MASK	0x00000FFF
#define	MCXNEX_HCR_CMD_STATUS_SHFT	24
#define	MCXNEX_HCR_CMD_GO_SHFT		23
#define	MCXNEX_HCR_CMD_E_SHFT		22
#define	MCXNEX_HCR_CMD_T_SHFT		21
#define	MCXNEX_HCR_CMD_OPMOD_SHFT	12

/*
 * Arbel "QUERY_DEV_LIM" command - Mcxnex, "QUERY_DEV_CAP" - Same hex code
 *    same function as tavor/arbel QUERY_DEV_LIM, just renamed (whatever).
 *    The QUERY_DEV_LIM command returns the device limits and capabilities
 *    supported by the Mcxnex device.  This command must be run before
 *    running the INIT_HCA command (below) in order to determine the maximum
 *    capabilities of the device and which optional features are supported.
 */
#ifdef  _LITTLE_ENDIAN
struct mcxnex_hw_querydevlim_s {
	uint32_t	rsrv0[4];

	uint32_t	log_max_scqs 	:4;
	uint32_t			:4;
	uint32_t	num_rsvd_scqs 	:6;
	uint32_t			:2;
	uint32_t	log_max_srq	:5;
	uint32_t			:7;
	uint32_t	log_rsvd_srq	:4;

	uint32_t	log_max_qp	:5;
	uint32_t			:3;
	uint32_t	log_rsvd_qp	:4;
	uint32_t			:4;
	uint32_t	log_max_qp_sz	:8;
	uint32_t	log_max_srq_sz	:8;

	uint32_t	log_max_eq	:4;
	uint32_t			:4;
	uint32_t	num_rsvd_eq	:4;
	uint32_t			:4;
	uint32_t	log_max_dmpt	:6;
	uint32_t			:2;
	uint32_t	log_max_eq_sz	:8;

	uint32_t	log_max_cq	:5;
	uint32_t			:3;
	uint32_t	log_rsvd_cq	:4;
	uint32_t			:4;
	uint32_t	log_max_cq_sz	:8;
	uint32_t			:8;


	uint32_t			:32;

	uint32_t	log_max_mtt	:6;
	uint32_t			:2;
	uint32_t	log_rsvd_dmpt	:4;
	uint32_t			:4;
	uint32_t	log_max_mrw_sz	:8;
	uint32_t			:4;
	uint32_t	log_rsvd_mtt	:4;

	uint32_t	log_max_ra_glob	:6;
	uint32_t			:2;
	uint32_t	log_max_rss_tbl_sz :4;
	uint32_t	rss_toep	:1;	/* rss toeplitz hashing */
	uint32_t	rss_xor		:1;	/* rss xor hashing */
	uint32_t			:2;
	uint32_t	log_max_gso_sz	:5;	/* Lge Send Offload */
	uint32_t			:11;	/* new w/ 0.35, RSS info */

	uint32_t	log_max_ra_res_qp	:6;
	uint32_t			:10;
	uint32_t	log_max_ra_req_qp	:6;
	uint32_t			:10;

	uint32_t	num_ports	:4;
	uint32_t			:12;
	uint32_t	ca_ack_delay	:5;
	uint32_t			:11;

	uint32_t	mod_wr_srq	:1;
	uint32_t			:31;

	uint32_t			:4;
	uint32_t			:12;
	uint32_t	stat_rate_sup	:16;

	uint32_t			:4;
	uint32_t			:12;
	uint32_t			:8;
	uint32_t	log_max_msg	:5;
	uint32_t			:3;

	uint32_t	rc		:1;
	uint32_t	uc		:1;
	uint32_t	ud		:1;
	uint32_t	xrc		:1;
	uint32_t	rcm		:1;
	uint32_t	fcoib		:1;
	uint32_t	srq		:1;
	uint32_t	ipoib_cksm	:1;
	uint32_t	pkey_v		:1;
	uint32_t	qkey_v		:1;
	uint32_t	vmm		:1;
	uint32_t			:5;
	uint32_t	mem_win		:1;
	uint32_t	apm		:1;
	uint32_t	atomic		:1;
	uint32_t	raw_multi	:1;
	uint32_t	avp		:1;
	uint32_t	ud_multi	:1;
	uint32_t			:2;
	uint32_t	pg_on_demand	:1;
	uint32_t	router		:1;
	uint32_t			:6;

	uint32_t			:32;

	uint32_t	log_max_bf_page	:6;
	uint32_t			:2;
	uint32_t	log_max_bf_req_ppg :6;
	uint32_t			:2;
	uint32_t	log_bf_reg_sz	:5;
	uint32_t			:10;
	uint32_t	blu_flm		:1;

