Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_hw.h
	uint32_t	log_pg_sz	:8;
	uint32_t			:8;
	uint32_t	log_max_uar_sz	:6;
	uint32_t			:6;
	uint32_t	num_rsvd_uar	:4;

	uint32_t	max_desc_sz_rq	:16;
	uint32_t	max_sg_rq	:8;
	uint32_t			:8;

	uint32_t	max_desc_sz_sq	:16;
	uint32_t	max_sg_sq	:8;
	uint32_t			:8;

	uint32_t	rsvd_fcoib[2];

	uint32_t	log_max_srcd	:4;
	uint32_t			:8;
	uint32_t	num_rsvd_srcds	:4;
	uint32_t	log_max_pd	:5;
	uint32_t			:7;
	uint32_t	num_rsvd_pd	:4;

	uint32_t	log_max_mcg	:8;
	uint32_t	num_rsvd_mcg	:4;
	uint32_t			:4;
	uint32_t	log_max_qp_mcg	:8;
	uint32_t			:8;

	uint32_t	rsrv2[6];

	uint32_t	altc_entry_sz	:16;
	uint32_t	aux_entry_sz	:16;

	uint32_t	qpc_entry_sz	:16;
	uint32_t	rdmardc_entry_sz :16;

	uint32_t	cmpt_entry_sz	:16;
	uint32_t	srq_entry_sz	:16;

	uint32_t	cqc_entry_sz	:16;
	uint32_t	eqc_entry_sz	:16;

	uint32_t	bmme		:1;
	uint32_t	win_type	:1;
	uint32_t	mps		:1;
	uint32_t	bl		:1;
	uint32_t	zb		:1;
	uint32_t	lif		:1;
	uint32_t	local_inv	:1;
	uint32_t	remote_inv	:1;
	uint32_t			:1;
	uint32_t	win_type2	:1;
	uint32_t	reserved_lkey	:1;
	uint32_t	fast_reg_wr	:1;
	uint32_t			:20;

	uint32_t	dmpt_entry_sz	:16;
	uint32_t	mtt_entry_sz	:16;

	uint32_t			:32;

	uint32_t	rsv_lkey;

	uint64_t	max_icm_size;

	uint32_t	rsrv3[22];
};

#else		/* BIG ENDIAN */

struct mcxnex_hw_querydevlim_s {
	uint32_t	rsrv0[4];

	uint32_t	log_max_srq_sz	:8;
	uint32_t	log_max_qp_sz	:8;
	uint32_t			:4;
	uint32_t	log_rsvd_qp	:4;
	uint32_t			:3;
	uint32_t	log_max_qp	:5;

	uint32_t	log_rsvd_srq	:4;
	uint32_t			:7;
	uint32_t	log_max_srq	:5;
	uint32_t			:2;
	uint32_t	num_rsvd_scqs 	:6;
	uint32_t			:4;
	uint32_t	log_max_scqs 	:4;

	uint32_t			:8;
	uint32_t	log_max_cq_sz	:8;
	uint32_t			:4;
	uint32_t	log_rsvd_cq	:4;
	uint32_t			:3;
	uint32_t	log_max_cq	:5;

	uint32_t	log_max_eq_sz	:8;
	uint32_t			:2;
	uint32_t	log_max_dmpt	:6;
	uint32_t			:4;
	uint32_t	num_rsvd_eq	:4;
	uint32_t			:4;
	uint32_t	log_max_eq	:4;

	uint32_t	log_rsvd_mtt	:4;
	uint32_t			:4;
	uint32_t	log_max_mrw_sz	:8;
	uint32_t			:4;
	uint32_t	log_rsvd_dmpt	:4;
	uint32_t			:2;
	uint32_t	log_max_mtt	:6;

	uint32_t			:32;

	uint32_t			:10;
	uint32_t	log_max_ra_req_qp	:6;
	uint32_t			:10;
	uint32_t	log_max_ra_res_qp	:6;

	uint32_t			:11;	/* new w/ 0.35, RSS info */
	uint32_t	log_max_gso_sz	:5;	/* Lge Send Offload */
	uint32_t			:2;
	uint32_t	rss_xor		:1;	/* rss xor hashing */
	uint32_t	rss_toep	:1;	/* rss toeplitz hashing */
	uint32_t	log_max_rss_tbl_sz :4;
	uint32_t			:2;
	uint32_t	log_max_ra_glob	:6;

	uint32_t			:31;
	uint32_t	mod_wr_srq	:1;

	uint32_t			:11;
	uint32_t	ca_ack_delay	:5;
	/* PRM 0.35, stuff moved to per port info */
	uint32_t			:12;
	uint32_t	num_ports	:4;

	uint32_t			:3;
	uint32_t	log_max_msg	:5;
	uint32_t			:8;
	uint32_t			:12;
	uint32_t			:4;

	uint32_t	stat_rate_sup	:16;
	uint32_t			:12;
	uint32_t			:4;

	uint32_t			:32;

	uint32_t			:6;
	uint32_t	router		:1;
	uint32_t	pg_on_demand	:1;
	uint32_t			:2;
	uint32_t	ud_multi	:1;
	uint32_t	avp		:1;
	uint32_t	raw_multi	:1;
	uint32_t	atomic		:1;
	uint32_t	apm		:1;
	uint32_t	mem_win		:1;
	uint32_t			:5;
	uint32_t	vmm		:1;
	uint32_t	qkey_v		:1;
	uint32_t	pkey_v		:1;
	uint32_t	ipoib_cksm	:1;
	uint32_t	srq		:1;
	uint32_t	fcoib		:1;
	uint32_t	rcm		:1;
	uint32_t	xrc		:1;
	uint32_t	ud		:1;
	uint32_t	uc		:1;
	uint32_t	rc		:1;

	uint32_t	num_rsvd_uar	:4;
	uint32_t			:6;
	uint32_t	log_max_uar_sz	:6;
	uint32_t			:8;
	uint32_t	log_pg_sz	:8;

	uint32_t	blu_flm		:1;
	uint32_t			:10;
	uint32_t	log_bf_reg_sz	:5;
	uint32_t			:2;
	uint32_t	log_max_bf_req_ppg :6;
	uint32_t			:2;
	uint32_t	log_max_bf_page	:6;

	uint32_t			:8;
	uint32_t	max_sg_sq	:8;
	uint32_t	max_desc_sz_sq	:16;

	uint32_t			:8;
	uint32_t	max_sg_rq	:8;
	uint32_t	max_desc_sz_rq	:16;

	uint32_t	rsvd_fcoib[2];

	uint32_t			:8;
	uint32_t	log_max_qp_mcg	:8;
	uint32_t			:4;
	uint32_t	num_rsvd_mcg	:4;
	uint32_t	log_max_mcg	:8;

	uint32_t	num_rsvd_pd	:4;
	uint32_t			:7;
	uint32_t	log_max_pd	:5;
	uint32_t	num_rsvd_srcds	:4;
	uint32_t			:8;
	uint32_t	log_max_srcd	:4;

	uint32_t	rsrv2[6];

	uint32_t	rdmardc_entry_sz :16;
	uint32_t	qpc_entry_sz	:16;

	uint32_t	aux_entry_sz	:16;
	uint32_t	altc_entry_sz	:16;

	uint32_t	eqc_entry_sz	:16;
	uint32_t	cqc_entry_sz	:16;

	uint32_t	srq_entry_sz	:16;
	uint32_t	cmpt_entry_sz	:16;

	uint32_t	mtt_entry_sz	:16;
	uint32_t	dmpt_entry_sz	:16;

	uint32_t			:20;
	uint32_t	fast_reg_wr	:1;
	uint32_t	reserved_lkey	:1;
	uint32_t	win_type2	:1;
	uint32_t			:1;
	uint32_t	remote_inv	:1;
	uint32_t	local_inv	:1;
	uint32_t	lif		:1;
	uint32_t	zb		:1;
	uint32_t	bl		:1;
	uint32_t	mps		:1;
	uint32_t	win_type	:1;
	uint32_t	bmme		:1;

	uint32_t	rsv_lkey;

	uint32_t			:32;

	uint64_t	max_icm_size;

	uint32_t	rsrv3[22];
};
#endif



/*
 * Mcxnex "QUERY_FW" command
 *    The QUERY_FW command retrieves the firmware revision and the Command
 *    Interface revision.  The command also returns the HCA attached local
 *    memory area (DDR) which is used by the firmware.  Below we also
 *    include some defines which are used to enforce a minimum firmware
 *    version check (see mcxnex_fw_version_check() for more details).
 */

#ifdef	_LITTLE_ENDIAN
struct mcxnex_hw_queryfw_s {
	uint32_t	fw_rev_minor	:16;
	uint32_t	fw_rev_subminor	:16;

	uint32_t	fw_rev_major	:16;
	uint32_t	fw_pages	:16;

	uint32_t	log_max_cmd	:8;
	uint32_t			:23;
	uint32_t	dbg_trace	:1;

	uint32_t	cmd_intf_rev	:16;
	uint32_t			:16;

	uint32_t	fw_day	:8;
	uint32_t	fw_month	:8;
	uint32_t	fw_year	:16;

	uint32_t			:1;
	uint32_t	ccq		:1;
	uint32_t			:6;
	uint32_t	fw_sec	:8;
	uint32_t	fw_min	:8;
	uint32_t	fw_hour	:8;

	uint32_t	rsrv0[2];

	uint64_t	clr_intr_offs;

	uint32_t			:32;

	uint32_t			:30;
	uint32_t	clr_int_bar	:2;

	uint64_t	error_buf_addr;

	uint32_t			:30;
	uint32_t	err_buf_bar	:2;

	uint32_t	error_buf_sz;

	uint32_t	rsrv2[48];
};
#else
struct mcxnex_hw_queryfw_s {
	uint32_t	fw_pages	:16;
	uint32_t	fw_rev_major	:16;

	uint32_t	fw_rev_subminor	:16;
	uint32_t	fw_rev_minor	:16;

	uint32_t			:16;
	uint32_t	cmd_intf_rev	:16;

	uint32_t	dbg_trace	:1;
	uint32_t			:23;
	uint32_t	log_max_cmd	:8;

	uint32_t	fw_hour	:8;
	uint32_t	fw_min	:8;
	uint32_t	fw_sec	:8;
	uint32_t			:6;
	uint32_t	ccq		:1;
	uint32_t			:1;

	uint32_t	fw_year	:16;
	uint32_t	fw_month	:8;
	uint32_t	fw_day	:8;

	uint32_t	rsrv1[2];

	uint64_t	clr_intr_offs;

	uint32_t	clr_int_bar	:2;
	uint32_t			:30;

	uint32_t			:32;

