Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_hw.h
	uint64_t	error_buf_addr;

	uint32_t	error_buf_sz;

	uint32_t	err_buf_bar	:2;
	uint32_t			:30;

	uint32_t	rsrv2[48];
};
#endif

/*
 * need to have min 2.3.0 to include config_spec_qp and SMA in FW
 */

#define	MCXNEX_FW_VER_MAJOR		0x0002	/* TBD for Mcxnex */
#define	MCXNEX_FW_VER_MINOR		0x0005
#define	MCXNEX_FW_VER_SUBMINOR		0x0000

/*
 * Mcxnex "QUERY_ADAPTER" command
 *    The QUERY_ADAPTER command retrieves adapter specific parameters. The
 *    command also retrieves the PCI(X) interrupt pin routing for each of
 *    the INTx# pins supported by the device.  This information is used by
 *    the driver during interrupt processing in order to clear the appropriate
 *    interrupt bit.
 */
#ifdef	_LITTLE_ENDIAN
struct mcxnex_hw_queryadapter_s {
	uint32_t	rsrv0[4];

	uint32_t			:32;

	uint32_t			:24;
	uint32_t	inta_pin	:8;

	uint32_t	vsd_vend_id	:16;		/* added v35 mcxnex */
	uint32_t			:16;

	uint32_t			:32;

	uint32_t	vsd[52];
	uint32_t	psid[4];
};
#else
struct mcxnex_hw_queryadapter_s {
	uint32_t	rsrv0[4];

	uint32_t	inta_pin	:8;
	uint32_t			:24;

	uint32_t			:32;

	uint32_t			:32;

	uint32_t			:16;
	uint32_t	vsd_vend_id	:16;		/* added v35 mcxnex */

	uint32_t	vsd[52];
	uint32_t	psid[4];
};
#endif
#define	MCXNEX_REV_A0	0xA0
#define	MCXNEX_REV_A1	0xA1

/*
 * Virtual physical mapping structure for: MAP_FA, MAP_ICM_AUX, and
 * MAP_ICM commands.
 */

#ifdef	_LITTLE_ENDIAN
struct mcxnex_hw_vpm_s {
	uint32_t			:12;
	uint32_t	vaddr_l		:20;
	uint32_t	vaddr_h;

	uint32_t	log2sz	:5;
	uint32_t			:7;
	uint32_t	paddr_l		:20;
	uint32_t	paddr_h;
};
#else
struct mcxnex_hw_vpm_s {
	uint32_t	vaddr_h;
	uint32_t	vaddr_l		:20;
	uint32_t			:12;

	uint32_t	paddr_h;
	uint32_t	paddr_l		:20;
	uint32_t			:7;
	uint32_t	log2sz	:5;
};
#endif




/*
 * Mcxnex "INIT_HCA" and "QUERY_HCA" commands
 *    The INIT_HCA command configures all HCA resources in HCA attached local
 *    memory and some system relevant information.  The same mailbox output
 *    format is used by the QUERY_HCA command.  All parameters, which are
 *    specifically the output of the QUERY_HCA command are marked as
 *    "QUERY_HCA only".  These parameters are not configurable through the
 *    INIT_HCA command, but can be retrieved as read-only through the
 *    QUERY_HCA command.
 *
 *    Below we first define several structures which help make up the whole
 *    of the INIT_HCA/QUERY_HCA command.  These are:
 *    mcxnex_hw_qp_ee_cq_eq_rdb_t for "QPC/EEC/CQC/EQC/RDB Parameters",
 *    mcxnex_udav_mem_param_t for "Memory Access Parameters for UDAV Table",
 *    mcxnex_multicast_param_t for "Multicast Support Parameters",
 *    mcxnex_tpt_param_t for "Translation and Protection Table Parameters",
 *    and mcxnex_uar_param_t for Mcxnex "UAR Parameters".
 */

/*
 *  need to consider removing any ref to "ee", mcxnex doesn't support
 *       ee/rd stuff, and they've taken away the pretense
 */


#ifdef	_LITTLE_ENDIAN
typedef struct mcxnex_hw_qp_ee_cq_eq_rdb_s {
	uint32_t	rsrv0[4];

	uint32_t	log_num_qp	:5;
	uint32_t	qpc_baseaddr_l	:27;
	uint32_t	qpc_baseaddr_h;

	uint32_t	rsrv1[4];

	uint32_t	log_num_srq	:5;
	uint32_t	srqc_baseaddr_l	:27;
	uint32_t	srqc_baseaddr_h;

	uint32_t	log_num_cq	:5;
	uint32_t	cqc_baseaddr_l	:27;
	uint32_t	cqc_baseaddr_h;

	uint32_t	rsrv2[2];

	uint64_t	altc_baseaddr;

	uint32_t	rsrv3[2];

	uint64_t	auxc_baseaddr;

	uint32_t	rsrv4[2];

	uint32_t	log_num_eq	:5;
	uint32_t	eqc_baseaddr_l	:27;
	uint32_t	eqc_baseaddr_h;

	uint32_t	rsv5[2];

	uint32_t	log_num_rdmardc	:3;
	uint32_t			:2;
	uint32_t	rdmardc_baseaddr_l :27;
	uint32_t	rdmardc_baseaddr_h;

	uint32_t	rsrv6[2];
} mcxnex_hw_qp_ee_cq_eq_rdb_t;
#else
typedef struct mcxnex_hw_qp_ee_cq_eq_rdb_s {
	uint32_t	rsrv0[4];

	uint32_t	qpc_baseaddr_h;
	uint32_t	qpc_baseaddr_l	:27;
	uint32_t	log_num_qp	:5;

	uint32_t	rsrv1[4];

	uint32_t	srqc_baseaddr_h;
	uint32_t	srqc_baseaddr_l	:27;
	uint32_t	log_num_srq	:5;

	uint32_t	cqc_baseaddr_h;
	uint32_t	cqc_baseaddr_l	:27;
	uint32_t	log_num_cq	:5;

	uint32_t	rsrv2[2];

	uint64_t	altc_baseaddr;

	uint32_t	rsrv3[2];

	uint64_t	auxc_baseaddr;

	uint32_t	rsrv4[2];

	uint32_t	eqc_baseaddr_h;
	uint32_t	eqc_baseaddr_l	:27;
	uint32_t	log_num_eq	:5;

	uint32_t	rsv5[2];

	uint32_t	rdmardc_baseaddr_h;
	uint32_t	rdmardc_baseaddr_l :27;
	uint32_t			:2;
	uint32_t	log_num_rdmardc	:3;

	uint32_t	rsrv6[2];
} mcxnex_hw_qp_ee_cq_eq_rdb_t;
#endif




#ifdef	_LITTLE_ENDIAN
typedef struct mcxnex_multicast_param_s {
	uint64_t	mc_baseaddr;

	uint32_t	rsrv0[2];

	uint32_t	log_mc_tbl_hash_sz :5;
	uint32_t			:27;

	uint32_t	log_mc_tbl_ent	:5;
	uint32_t			:27;

	uint32_t			:32;

	uint32_t	log_mc_tbl_sz	:5;
	uint32_t			:19;
	uint32_t	mc_hash_fn	:3;
	uint32_t			:5;
} mcxnex_multicast_param_t;
#else
typedef struct mcxnex_multicast_param_s {
	uint64_t	mc_baseaddr;

	uint32_t	rsrv0[2];

	uint32_t			:27;
	uint32_t	log_mc_tbl_ent	:5;

	uint32_t			:27;
	uint32_t	log_mc_tbl_hash_sz :5;

	uint32_t			:5;
	uint32_t	mc_hash_fn	:3;
	uint32_t			:19;
	uint32_t	log_mc_tbl_sz	:5;

	uint32_t			:32;
} mcxnex_multicast_param_t;
#endif

#define	MCXNEX_MCG_DEFAULT_HASH_FN	0x0

#ifdef	_LITTLE_ENDIAN
typedef struct mcxnex_tpt_param_s {
	uint64_t	dmpt_baseaddr;

	uint32_t			:32;
	uint32_t	log_dmpt_sz	:6;
	uint32_t			:2;
	uint32_t	pgfault_rnr_to	:5;
	uint32_t			:19;

	uint64_t	mtt_baseaddr;

	uint64_t	cmpt_baseaddr;
} mcxnex_tpt_param_t;
#else
typedef struct mcxnex_tpt_param_s {
	uint64_t	dmpt_baseaddr;

	uint32_t			:19;
	uint32_t	pgfault_rnr_to	:5;
	uint32_t			:2;
	uint32_t	log_dmpt_sz	:6;
	uint32_t			:32;

	uint64_t	mtt_baseaddr;

	uint64_t	cmpt_baseaddr;
} mcxnex_tpt_param_t;
#endif


#ifdef	_LITTLE_ENDIAN
typedef struct mcxnex_uar_param_s {
	uint32_t	rsvd0[2];

	uint32_t			:32;

	uint32_t	uar_pg_sz	:8;
	uint32_t	log_max_uars	:4;
	uint32_t			:20;

	uint32_t	resvd1[4];
} mcxnex_uar_param_t;
#else
typedef struct mcxnex_uar_param_s {
	uint32_t	rsvd0[2];

	uint32_t			:20;
	uint32_t	log_max_uars	:4;
	uint32_t	uar_pg_sz	:8;

	uint32_t			:32;

	uint32_t	resvd1[4];
} mcxnex_uar_param_t;
#endif

/*
 * NEW for Mcxnex
 *   QP Allocation Params
 *
 */

