Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_hw.h
#ifdef _LITTLE_ENDIAN
typedef struct mcxnex_qp_alloc_param_s {
	uint32_t			:32;

	uint32_t	ccq_base	:24;
	uint32_t	log2ccqs	:5;
	uint32_t			:2;
	uint32_t	ccq_en	:1;

	uint32_t	rsvd[6];	/* but 0x14 def'd for fibre channel */
} mcxnex_qp_alloc_param_t;
#else /* BIG ENDIAN */
typedef struct mcxnex_qp_alloc_param_s {
	uint32_t	ccq_en		:1;
	uint32_t			:2;
	uint32_t	log2ccqs	:5;
	uint32_t	ccq_base	:24;

	uint32_t			:32;

	uint32_t	rsvd[6];	/* but 0x14 def'd for fibre channel */
} mcxnex_qp_alloc_param_t;
#endif

#ifdef	_LITTLE_ENDIAN
struct mcxnex_hw_initqueryhca_s {
	uint32_t			:32;

	uint32_t			:24;
	uint32_t	version	:8;

	uint32_t			:13;
	uint32_t	log2_cacheline  :3;
	uint32_t	hca_core_clock	:16;	/* QUERY_HCA only */

	uint32_t			:32;

	uint32_t	udav_port_chk	:1;
	uint32_t	big_endian	:1;
	uint32_t			:1;
	uint32_t	chsum_en	:1;
	uint32_t			:28;

	uint32_t	router_qp	:24;
	uint32_t			:5;
	uint32_t	ipr2		:1;
	uint32_t	ipr1		:1;
	uint32_t	router_en	:1;

	uint32_t	rsrv1[2];

	mcxnex_hw_qp_ee_cq_eq_rdb_t	context;

	uint32_t	rsrv2[8];

	mcxnex_multicast_param_t		multi;

	uint32_t	rsrv3[4];

	mcxnex_tpt_param_t		tpt;

	uint32_t	rsrv4[4];

	mcxnex_uar_param_t		uar;

	uint32_t	rsrv5[4];

	mcxnex_qp_alloc_param_t		qp_alloc;

	uint32_t	rsrv6[100];	/* from 0x16c to 0x2fc offsets */
};
#else	/* BIG ENDIAN */
struct mcxnex_hw_initqueryhca_s {
	uint32_t	version	:8;
	uint32_t			:24;

	uint32_t			:32;

	uint32_t			:32;

	uint32_t	hca_core_clock	:16;	/* QUERY_HCA only */
	uint32_t	log2_cacheline	:3;
	uint32_t			:13;

	uint32_t	router_en	:1;
	uint32_t	ipr1		:1;
	uint32_t	ipr2		:1;
	uint32_t			:5;
	uint32_t	router_qp	:24;

	uint32_t			:28;
	uint32_t	chsum_en	:1;
	uint32_t			:1;
	uint32_t	big_endian	:1;
	uint32_t	udav_port_chk	:1;

	uint32_t	rsrv1[2];

	mcxnex_hw_qp_ee_cq_eq_rdb_t	context;

	uint32_t	rsrv2[8];

	mcxnex_multicast_param_t		multi;

	uint32_t	rsrv3[4];

	mcxnex_tpt_param_t		tpt;

	uint32_t	rsrv4[4];

	mcxnex_uar_param_t		uar;

	uint32_t	rsrv5[4];

	mcxnex_qp_alloc_param_t		qp_alloc;

	uint32_t	rsrv6[100];	/* from 0x16c to 0x2fc offsets */
};
#endif
#define	MCXNEX_UDAV_PROTECT_DISABLED	0x0
#define	MCXNEX_UDAV_PROTECT_ENABLED	0x1
#define	MCXNEX_UDAV_PORTCHK_DISABLED	0x0
#define	MCXNEX_UDAV_PORTCHK_ENABLED	0x1


/*
 * Mcxnex "INIT_IB"/"INIT_PORT" command
 *    The INIT_IB/INIT_PORT command enables the physical layer of an IB port.
 *    It provides control over the IB port attributes.  The capabilities
 *    requested here should not exceed the device limits, as retrieved by
 *    the QUERY_DEV_LIM/CAP command (above).  To query information about the IB
 *    port or node, the driver may submit GetPortInfo or GetNodeInfo MADs
 *    through the Mcxnex MAD_IFC command.
 *
 *	Changed name to initport, but operates similar to initib - but as of
 *	PRM v0.35c the initport just does that, and the params set previously
 *	by initib are now set in SET_PORT
 */




/*
 * MCXNEX query_port and set_port commands.  QUERY_PORT is new for mcxnex,
 *	doing some of what used to be done in the QUERY_DEV_CAP command.  It is
 *	introduced in PRM v0.35 and will need to be added to the list of
 *	supported HCA commands
 *
 *	SET_PORT is similar to the SET_IB command from tavor and arbel.  Here,
 *	tho, it's more extensive and will be easier to deal with I suspect by
 * 	making it a structure and filling it in and then doing the copy to the
 *	mailbox (instead of just writing the minimal information to the mailbox
 *	directly as was done for the previous HCAs).
 */

#ifdef _LITTLE_ENDIAN
struct mcxnex_hw_query_port_s {
	uint32_t	log_max_pkey 	:4;	/* pkey table size */
	uint32_t	log_max_gid	:4;	/* max gids / port */
	/* was max_port_width arbel: long list of values */
	uint32_t	ib_port_wid	:4;
	uint32_t			:4;
	uint32_t			:4;	/* other types possibly */
	uint32_t			:4;
	/*
	 * 0x1=2.5G, 0x3=2.5 or 5.0G, 0x5=2.5 or 10G
	 *	0x7=2.5, 5.0, or 10G, others rsvd
	 */
	uint32_t	ib_link_spd	:4;

	uint32_t			:4;

	uint32_t			:16;	/* used for other types (?) */
	uint32_t	ib_mtu		:4;
	/*
	 * 0x0 rsvd, 0x1=256, 0x2=512, 0x3=1024, 0x5=2048
	 * 0x5=4096, others rsvd
	 */
	uint32_t			:4;
	uint32_t	port_type	:8;	/* 0x00, 0x01 IB, others TBD */

	uint32_t			:32;
	/* max vl's supported (not incl vl_15) */
	uint32_t	max_vl		:4;
	uint32_t			:4;
	uint32_t			:8;	/* but others possibly */
	uint32_t			:16;

	uint64_t	def_mac;		/* default mac address */
	uint32_t	rsvd1[504];
};
#else /* BIG ENDIAN */
struct mcxnex_hw_query_port_s {
	uint32_t	port_type	:8;	/* 0x00, 0x01 IB, others TBD */
	uint32_t			:4;
	/*
	 * 0x0 rsvd, 0x1=256, 0x2=512, 0x3=1024, 0x5=2048
	 * 0x1=256, 0x2=512, 0x3=1024, 0x5=2048
	 */
	uint32_t	ib_mtu		:4;
						/*	0x5=4096, others rsvd */
	uint32_t			:16;	/* used for other types (?) */

	uint32_t			:4;
	uint32_t	ib_link_spd	:4;
	/*
	 * 0x1=2.5G, 0x3=2.5 or 5.0G, 0x5=2.5 or 10G
	 *	0x7=2.5, 5.0, or 10G, others rsvd
	 */
	uint32_t			:4;
	uint32_t			:4;	/* other types possibly */
	uint32_t			:4;
	/* was max_port_width arbel: long list of values */
	uint32_t	ib_port_wid	:4;
	uint32_t	log_max_gid	:4;	/* max gids / port */
	uint32_t	log_max_pkey	:4;	/* pkey table size */

	uint32_t			:16;
	uint32_t			:8;	/* but others possibly */
	uint32_t			:4;
	/* max vl's supported (not incl vl_15) */
	uint32_t	max_vl		:4;

	uint32_t			:32;

	/* setting value for different mac */
	uint64_t	def_mac;
	uint32_t	rsvd1[504];

};
#endif

#ifdef _LITTLE_ENDIAN
struct mcxnex_hw_set_port_s {
	uint32_t	cap_mask;

	uint32_t	rqk		:1;	/* reset qkey violation cntr */
	uint32_t	rcm		:1;	/* reset capability mask */
	uint32_t			:2;
	uint32_t	vl_cap		:4;
	uint32_t			:4;
	uint32_t	mtu_cap		:4;
	uint32_t	g0		:1;	/* set port GUID0 */
	uint32_t	ng		:1;	/* set node GUID (all ports) */
	uint32_t	sig		:1;	/* set sys image */
	uint32_t	mg		:1;	/* change GID table */
	uint32_t	mp		:1;	/* change pkey table size */
	uint32_t	mvc		:1;	/* change vl_cap */
	uint32_t	mmc		:1;	/* change mtu_cap */
	uint32_t			:9;

	uint64_t	sys_img_guid;

	uint64_t	guid0;

	uint64_t	node_guid;

	uint32_t	sniff_qpn_base  :24;
	uint32_t	ge		:1;	/* glob egress sniff enabled */
	uint32_t	gi		:1;	/* glob ingress sniff enabled */
	uint32_t	qe		:1;	/* qp-egress sniff enable */
	uint32_t	qi		:1;	/* qp-ingress sniff enabled */
	uint32_t			:4;

	uint32_t	router_qpn_base :24;
	uint32_t	routermode	:1;
	uint32_t			:7;

	uint32_t			:32;

	uint32_t	max_guid	:16;	/* valid if noted above */
	uint32_t	max_pkey	:16;	/* valid if noted above */

