Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_hw.h
	uint32_t	rsrd0[500];
};
#else	/* BIG ENDIAN */
struct mcxnex_hw_set_port_s {
	uint32_t			:9;
	uint32_t	mmc		:1;	/* change mtu_cap */
	uint32_t	mvc		:1;	/* change vl_cap */
	uint32_t	mp		:1;	/* change pkey table size */
	uint32_t	mg		:1;	/* change GID table size */
	uint32_t	sig		:1;	/* set sys image GUID */
	uint32_t	ng		:1;	/* set node GUID (all ports) */
	uint32_t	g0		:1;	/* set port GUID0 */
	uint32_t	mtu_cap		:4;
	uint32_t			:4;
	uint32_t	vl_cap		:4;
	uint32_t			:2;
	uint32_t	rcm		:1;	/* reset capability mask */
	uint32_t	rqk		:1;	/* reset qkey violation cntr */

	uint32_t	cap_mask;

	uint64_t	sys_img_guid;

	uint64_t	guid0;

	uint64_t	node_guid;

	uint32_t			:7;
	uint32_t	routermode	:1;
	uint32_t	router_qpn_base :24;

	uint32_t			:4;
	uint32_t	qi		:1;	/* qp-ingress sniff enabled */
	uint32_t	qe		:1;	/* qp-egress sniff enable */
	uint32_t	gi		:1;	/* glob ingress sniff enabled */
	uint32_t	ge		:1;	/* glob egress sniff enabled */
	uint32_t	sniff_qpn_base  :24;

	uint32_t	max_pkey	:16;	/* valid if noted above */
	uint32_t	max_guid	:16;	/* valid if noted above */

	uint32_t			:32;

	uint32_t	rsrd0[500];
};
#endif




/*
 * Mcxnex Memory Protection Table (MPT) entries
 *
 *    The Memory Protection Table (MPT) contains the information associated
 *    with all the regions and windows. The MPT table resides in a virtually-
 *    contiguous area in ICM, and the memory key (R_Key or L_Key) is used to
 *    calculate the physical address for accessing the entries in the table.
 *
 *
 *    The SW2HW_MPT command transfers ownership of an MPT entry from software
 *    to hardware. The command takes the MPT entry from the input mailbox and
 *    stores it in the MPT in the hardware. The command will fail if the
 *    requested MPT entry is already owned by the hardware or if the MPT index
 *    given in the command is inconsistent with the MPT entry memory key.
 *    The QUERY_MPT command retrieves a snapshot of an MPT entry. The command
 *    takes the current state of an MPT entry from the hardware and stores it
 *    in the output mailbox.  The command will fail if the requested MPT entry
 *    is already owned by software.
 *    Finally, the HW2SW_MPT command transfers ownership of an MPT entry from
 *    the hardware to the software. The command takes the MPT entry from the
 *    hardware, invalidates it, and stores it in the output mailbox. The
 *    command will fail if the requested entry is already owned by software.
 *    The command will also fail if the MPT entry in question is a Memory
 *    Region which has Memory Windows currently bound to it.
 *
 *    The following structure is used in the SW2HW_MPT, QUERY_MPT, and
 *    HW2SW_MPT commands, and ONLY for the dMPT - for data.
 */

#ifdef _LITTLE_ENDIAN
struct mcxnex_hw_dmpt_s {
	uint32_t			:7;
	uint32_t	bnd_qp		:1;
	uint32_t	qpn		:24;	/* dw 1, byte 4-7 */

	uint32_t			:8;
	uint32_t	reg_win		:1;
	uint32_t	phys_addr	:1;
	uint32_t	lr		:1;
	uint32_t	lw		:1;
	uint32_t	rr		:1;
	uint32_t	rw		:1;
	uint32_t	atomic		:1;
	uint32_t	en_bind		:1;
	uint32_t	atc_req		:1;
	uint32_t	atc_xlat	:1;
	uint32_t			:1;
	uint32_t	no_snoop	:1;
	uint32_t			:8;
	uint32_t	status		:4;	/* dw 0, byte 0-3 */

	uint32_t	pd		:24;
	uint32_t	ren_inval	:1;
	uint32_t	en_inval	:1;
	uint32_t	net_cache	:1;
	uint32_t	fast_reg_en	:1;
	uint32_t	rem_acc_en	:1;
	uint32_t	w_dif		:1;
	uint32_t	m_dif		:1;
	uint32_t			:1; 	/* dw 2, byte 0xc-f */

	uint32_t	mem_key;
	uint64_t	start_addr;		/* dw 4-5, byte 0x10-17 */

	uint64_t	reg_win_len;		/* dw 6-7, byte 0x18-1f */

	uint32_t	win_cnt		:24;
	uint32_t			:8; 	/* dw 9, byte 0x24-27 */

	uint32_t	lkey;			/* dw 8, byte 0x20-23 */

	uint32_t	mtt_addr_h	:8;
	uint32_t			:24;	/* dw 11, byte 0x2c-2f */

	uint32_t	mtt_rep		:4;
	uint32_t			:17;
	uint32_t	blk_mode	:1;
	uint32_t	len_b64		:1;	/* bit 64 of length */
	uint32_t	fbo_en		:1;
	uint32_t			:8; 	/* dw 10, byte 0x28-2b */

	uint32_t	mtt_size;		/* dw 13, byte 0x34-37 */

	uint32_t			:3;
	uint32_t	mtt_addr_l	:29; 	/* dw 12, byte 0x30-33 */

	uint32_t	mtt_fbo		:21;
	uint32_t			:11; 	/* dw 15, byte 0x3c-3f */

	uint32_t	entity_sz	:21;
	uint32_t			:11;	/* dw 14, byte 0x38-3b */
#ifdef MCXNEX_NOTIMPL
	uint32_t	dif_m_atag	:16;
	uint32_t			:16;	/* dw 17, 0x44-47 */

	uint32_t	dif_a_msk	:16;
	uint32_t	dif_v_msk	:2;
	uint32_t	dif_rep		:2;
	uint32_t			:9;
	uint32_t	dif_err		:3; 	/* dw 16, 0x40-43 */

	uint32_t	dif_w_atag	:16;
	uint32_t			:16;	/* dw 19, 0x4c-4f */

	uint32_t	dif_m_rtagb;		/* dw 18, 0x48-4b */

	uint32_t			:32;

	uint32_t	dif_w_rtagb;		/* dw 20, 0x50-53 */
#endif /* MCXNEX_NOTIMPL */
};

#else /* BIG ENDIAN */
struct mcxnex_hw_dmpt_s {
	uint32_t	status		:4;
	uint32_t			:8;
	uint32_t	no_snoop	:1;
	uint32_t			:1;
	uint32_t	atc_xlat	:1;
	uint32_t	atc_req		:1;
	uint32_t	en_bind		:1;
	uint32_t	atomic		:1;
	uint32_t	rw		:1;
	uint32_t	rr		:1;
	uint32_t	lw		:1;
	uint32_t	lr		:1;
	uint32_t	phys_addr	:1;
	uint32_t	reg_win		:1;
	uint32_t			:8;	/* dw 0, byte 0x0-3 */

	uint32_t	qpn		:24;
	uint32_t	bnd_qp		:1;
	uint32_t			:7;	/* dw 1, byte 0x4-7 */

	uint32_t	mem_key;		/* dw 2, byte 0x8-b */

	uint32_t			:1;
	uint32_t	m_dif		:1;
	uint32_t	w_dif		:1;
	uint32_t	rem_acc_en	:1;
	uint32_t	fast_reg_en	:1;
	uint32_t	net_cache	:1;
	uint32_t	en_inval	:1;
	uint32_t	ren_inavl	:1;
	uint32_t	pd		:24;	/* dw 3, byte 0xc-f */

	uint64_t	start_addr;		/* dw 4-5, byte 0x10-17 */

	uint64_t	reg_win_len;		/* dw 6-7, byte 0x18-1f */

	uint32_t	lkey;			/* dw 8, bytd 0x20-23 */

	uint32_t			:8;
	uint32_t	win_cnt		:24;	/* dw 9, byte 0x24-27 */

	uint32_t			:8;
	uint32_t	fbo_en		:1;
	uint32_t	len_b64		:1;	/* bit 64 of length */
	uint32_t	blk_mode	:1;
	uint32_t			:17;
	uint32_t	mtt_rep		:4;	/* dw 10, byte 0x28-2b */

	uint32_t			:24;
	uint32_t	mtt_addr_h	:8;	/* dw 11, byte 0x2c-2f */

	uint32_t	mtt_addr_l	:29;
	uint32_t			:3;	/* dw 12, byte 0x30-33 */

	uint32_t	mtt_size;		/* dw 13, byte 0x34-37 */

	uint32_t			:11;
	uint32_t	entity_sz	:21;	/* dw 14, byte 0x38-3b */

	uint32_t			:11;
	uint32_t	mtt_fbo		:21;	/* dw 15, byte 0x3c-3f */
#ifdef MCXNEX_NOTIMPL

