Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_hw.h
	uint32_t	dif_err		:3;
	uint32_t			:9;
	uint32_t	dif_rep		:2;
	uint32_t	dif_v_msk	:2;
	uint32_t	dif_a_msk	:16;	/* dw 16, 0x40-43 */

	uint32_t			:16;
	uint32_t	dif_m_atag	:16;	/* dw 17, 0x44-47 */

	uint32_t	dif_m_rtagb;		/* dw 18, 0x48-4b */

	uint32_t			:16;
	uint32_t	dif_w_atag	:16;	/* dw 19, 0x4c-4f */

	uint32_t	dif_w_rtagb;		/* dw 20, 0x50-53 */

	uint32_t			:32;
#endif  /* MCXNEX_NOTIMPL */
};
#endif

/*
 * The following structure is for the CMPTs.  This is NEVER actually built and
 * passed to the hardware - we use it to track information needed for the
 * context entries, and to facilitate the alloc tracking.  It differs from
 * the dMPT sturcture above in that it does not have/need the "dif" stuff.
 *
 */



#ifdef _LITTLE_ENDIAN
struct mcxnex_hw_cmpt_s {
	uint32_t			:7;
	uint32_t	bnd_qp		:1;
	uint32_t	qpn		:24;	/* dw 1, byte 4-7 */

	uint32_t			:8;
	uint32_t	reg_win	:1;
	uint32_t	phys_addr	:1;
	uint32_t	lr		:1;
	uint32_t	lw		:1;
	uint32_t	rr		:1;
	uint32_t	rw		:1;
	uint32_t	atomic		:1;
	uint32_t	en_bind		:1;
	uint32_t	atc_req		:1;
	uint32_t	atc_xlat	:1;
	uint32_t			:1;
	uint32_t	no_snoop	:1;
	uint32_t			:8;
	uint32_t	status		:4;	/* dw 0, byte 0-3 */

	uint32_t	pd		:24;
	uint32_t	ren_inval	:1;
	uint32_t	en_inval	:1;
	uint32_t	net_cache	:1;
	uint32_t	fast_reg_en	:1;
	uint32_t	rem_acc_en	:1;
	uint32_t	w_dif		:1;
	uint32_t	m_dif		:1;
	uint32_t			:1; 	/* dw 2, byte 0xc-f */

	uint32_t	mem_key;
	uint64_t	start_addr;		/* dw 4-5, byte 0x10-17 */

	uint64_t	reg_win_len;		/* dw 6-7, byte 0x18-1f */

	uint32_t	win_cnt	:24;
	uint32_t			:8; 	/* dw 9, byte 0x24-27 */

	uint32_t	lkey;			/* dw 8, byte 0x20-23 */

	uint32_t	mtt_addr_h	:8;
	uint32_t			:24;	/* dw 11, byte 0x2c-2f */

	uint32_t	mtt_rep		:4;
	uint32_t			:17;
	uint32_t	blk_mode	:1;
	uint32_t	len_b64	:1;	/* bit 64 of length */
	uint32_t	fbo_en	:1;
	uint32_t			:8; 	/* dw 10, byte 0x28-2b */

	uint32_t	mtt_size;		/* dw 13, byte 0x34-37 */

	uint32_t			:3;
	uint32_t	mtt_addr_l	:29; 	/* dw 12, byte 0x30-33 */

	uint32_t	mtt_fbo	:21;
	uint32_t			:11; 	/* dw 15, byte 0x3c-3f */

	uint32_t	entity_sz	:21;
	uint32_t			:11;	/* dw 14, byte 0x38-3b */

};


#else /* BIG ENDIAN */
struct mcxnex_hw_cmpt_s {
	uint32_t	status	:4;
	uint32_t			:8;
	uint32_t	no_snoop	:1;
	uint32_t			:1;
	uint32_t	atc_xlat	:1;
	uint32_t	atc_req	:1;
	uint32_t	en_bind	:1;
	uint32_t	atomic	:1;
	uint32_t	rw		:1;
	uint32_t	rr		:1;
	uint32_t	lw		:1;
	uint32_t	lr		:1;
	uint32_t	phys_addr	:1;
	uint32_t	reg_win	:1;
	uint32_t			:8;	/* dw 0, byte 0x0-3 */

	uint32_t	qpn		:24;
	uint32_t	bnd_qp	:1;
	uint32_t			:7;	/* dw 1, byte 0x4-7 */

	uint32_t	mem_key;		/* dw 2, byte 0x8-b */

	uint32_t			:1;
	uint32_t	m_dif		:1;
	uint32_t	w_dif		:1;
	uint32_t	rem_acc_en	:1;
	uint32_t	fast_reg_en	:1;
	uint32_t	net_cache	:1;
	uint32_t	en_inval	:1;
	uint32_t	ren_inavl	:1;
	uint32_t	pd		:24;	/* dw 3, byte 0xc-f */

	uint64_t	start_addr;		/* dw 4-5, byte 0x10-17 */

	uint64_t	reg_win_len;	/* dw 6-7, byte 0x18-1f */

	uint32_t	lkey;			/* dw 8, bytd 0x20-23 */

	uint32_t			:8;
	uint32_t	win_cnt	:24;	/* dw 9, byte 0x24-27 */

	uint32_t			:8;
	uint32_t	fbo_en	:1;
	uint32_t	len_b64	:1;	/* bit 64 of length */
	uint32_t	blk_mode	:1;
	uint32_t			:17;
	uint32_t	mtt_rep	:4;	/* dw 10, byte 0x28-2b */

	uint32_t			:24;
	uint32_t	mtt_addr_h	:8;	/* dw 11, byte 0x2c-2f */

	uint32_t	mtt_addr_l	:29;
	uint32_t			:3;	/* dw 12, byte 0x30-33 */

	uint32_t	mtt_size;		/* dw 13, byte 0x34-37 */

	uint32_t			:11;
	uint32_t	entity_sz	:21;	/* dw 14, byte 0x38-3b */
};
#endif


#define	MCXNEX_MEM_CYCLE_GENERATE	0x1
#define	MCXNEX_IO_CYCLE_GENERATE	0x0

#define	MCXNEX_MPT_IS_WINDOW		0x0
#define	MCXNEX_MPT_IS_REGION		0x1

#define	MCXNEX_MPT_DEFAULT_VERSION	0x0

#define	MCXNEX_UNLIMITED_WIN_BIND	0x0

#define	MCXNEX_PHYSADDR_ENABLED		0x1
#define	MCXNEX_PHYSADDR_DISABLED	0x0


/*
 * Mcxnex Memory Translation Table (MTT) entries
 *    After accessing the MPT table (above) and validating the access rights
 *    to the region/window, Mcxnex address translation moves to the next step
 *    where it translates the virtual address to a physical address.  This
 *    translation is performed using the Memory Translation Table entries
 *    (MTT).  Note: The MTT in hardware is organized into segments and each
 *    segment contains multiple address translation pages (MTT entries).
 *    Each memory region (MPT above) points to the first segment in the MTT
 *    that corresponds to that region.
 */

#ifdef _LITTLE_ENDIAN
struct mcxnex_hw_mtt_s {
	uint32_t	present	:1;
	uint32_t		:2;
	uint32_t	ptag_l	:29;

	uint32_t	ptag_h;
};
#else /* BIG_ENDIAN */
struct mcxnex_hw_mtt_s {
	uint32_t	ptag_h;

	uint32_t	ptag_l	:29;
	uint32_t		:2;
	uint32_t	present	:1;
};

#endif
#define	MCXNEX_MTT_ENTRY_NOTPRESENT	0x0
#define	MCXNEX_MTT_ENTRY_PRESENT	0x1


/*
 * Mcxnex Event Queue Context Table (EQC) entries
 *    Mcxnex supports 512 Event Queues, and the status of Event Queues is stored
 *    in the Event Queue Context (EQC) table.  The EQC table is a virtually-
 *    contiguous memory structure in the ICM.  Each EQC
 *    table entry contains Event Queue status and information required by
 *    the hardware in order to access the event queue.
 * 	NOTE that in Mcxnex (as opposed to earlier HCAs),
 *	you have to allocate ICM for 2**32 (or about 16 M), even though
 *	it doesn't support that many.  See PRM v35.  Also, some set of them
 * 	will be available for each domain in a virtual environment, needing to
 *	rething the allocation and usage model for EQs - in the future.
 *
 *    The following structure is used in the SW2HW_EQ, QUERY_EQ, and HW2SW_EQ
 *    commands.
 *    The SW2HW_EQ command transfers ownership of an EQ context from software
 *    to hardware. The command takes the EQC entry from the input mailbox and
 *    stores it in the EQC in the hardware. The command will fail if the
 *    requested EQC entry is already owned by the hardware.  NOTE:  the
 *    initialization of the cMPT for the EQC occurs implicitly as a result
 *    of executing this command, and MR has/had to be adjusted for it.
 *    The QUERY_EQ command retrieves a snapshot of an EQC entry. The command
 *    stores the snapshot in the output mailbox.  The EQC state and its values
 *    are not affected by the QUERY_EQ command.
 *    Finally, the HW2SW_EQ command transfers ownership of an EQC entry from
 *    the hardware to the software. The command takes the EQC entry from the
 *    hardware and stores it in the output mailbox. The EQC entry will be
 *    invalidated as a result of the command.  It is the responsibility of the
 *    software to unmap all the events, which might have been previously
 *    mapped to the EQ, prior to issuing the HW2SW_EQ command.
 */


#ifdef	_LITTLE_ENDIAN
struct mcxnex_hw_eqc_s {
	uint32_t			:32;

	uint32_t			:8;
	uint32_t	state		:4;
	uint32_t			:5;
	uint32_t	overrun_ignore	:1;
	uint32_t	ev_coalesc	:1;
	uint32_t			:9;
	uint32_t	status		:4;

	uint32_t			:24;
	uint32_t	log_eq_sz	:5;
	uint32_t			:3;

