Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_hw.h
	uint32_t			:5;
	uint32_t	pg_offs		:7;
	uint32_t			:20;

	uint32_t	intr		:10;
	uint32_t			:22;

	uint32_t	eq_max_cnt	:16;
	uint32_t	eq_period	:16;

	uint32_t			:3;
	uint32_t	mtt_base_addrl	:29;

	uint32_t	mtt_base_addrh 	:8;
	uint32_t			:16;
	uint32_t	log2_pgsz	:6;	/* in 4K pages */
	uint32_t			:2;

	uint32_t	rsrv0[2];

	uint32_t	prod_indx	:24;
	uint32_t			:8;

	uint32_t	cons_indx	:24;
	uint32_t			:8;

	uint64_t	rsrv1[2];	/* force it to 8b alignment */
};
#else /* BIG ENDIAN */
struct mcxnex_hw_eqc_s {
	uint32_t	status		:4;
	uint32_t			:9;
	uint32_t	ev_coalesc	:1;
	uint32_t	overrun_ignore	:1;
	uint32_t			:5;
	uint32_t	state		:4;
	uint32_t			:8;

	uint32_t			:32;

	uint32_t			:20;
	uint32_t	pg_offs		:7;
	uint32_t			:5;

	uint32_t			:3;
	uint32_t	log_eq_sz	:5;
	uint32_t			:24;

	uint32_t	eq_period	:16;
	uint32_t	eq_max_cnt	:16;

	uint32_t			:22;
	uint32_t	intr		:10;

	uint32_t			:2;
	uint32_t	log2_pgsz	:6;	/* in 4K pages */
	uint32_t			:16;
	uint32_t	mtt_base_addrh 	:8;

	uint32_t	mtt_base_addrl	:29;
	uint32_t			:3;

	uint32_t	rsrv0[2];

	uint32_t			:8;
	uint32_t	cons_indx	:24;

	uint32_t			:8;
	uint32_t	prod_indx	:24;

	uint64_t	rsrv1[2];	/* force it to 8b alignment */
};
#endif
#define	MCXNEX_EQ_STATUS_OK		0x0
#define	MCXNEX_EQ_STATUS_OVERFLOW	0x9
#define	MCXNEX_EQ_STATUS_WRITE_FAILURE	0xA

#define	MCXNEX_EQ_ARMED			0x9
#define	MCXNEX_EQ_FIRED			0xA
#define	MCXNEX_EQ_ALWAYS_ARMED		0xB


/*
 * Mcxnex Event Queue Entries (EQE)
 *    Each EQE contains enough information for the software to identify the
 *    source of the event.  The following structures are used to define each
 *    of the various kinds of events that the Mcxnex hardware will generate.
 *    Note: The mcxnex_hw_eqe_t below is the generic "Event Queue Entry".  All
 *    other EQEs differ only in the contents of their "event_data" field.
 *
 *    Below we first define several structures which define the contents of
 *    the "event_data" fields:
 *    mcxnex_hw_eqe_cq_t for "Completion Queue Events"
 *    mcxnex_hw_eqe_qp_evt_t for "Queue Pair Events" such as Path Migration
 *        Succeeded, Path Migration Failed, Communication Established, Send
 *        Queue Drained, Local WQ Catastrophic Error, Invalid Request Local
 *        WQ Error, and Local Access Violation WQ Error.
 *    mcxnex_hw_eqe_cqerr_t for "Completion Queue Error Events"
 *    mcxnex_hw_eqe_portstate_t for "Port State Change Events"
 *    mcxnex_hw_eqe_gpio_t for "GPIO State Change Events"
 *    mcxnex_hw_eqe_cmdcmpl_t for "Command Interface Completion Events"
 *    mcxnex_hw_eqe_operr_t for "Operational and Catastrophic Error Events"
 *        such as EQ Overflow, Misbehaved UAR page, Internal Parity Error,
 *        Uplink bus error, and DDR data error.
 *    mcxnex_hw_eqe_pgflt_t for "Not-present Page Fault on WQE or Data
 *        Buffer Access".  (Note: Currently, this event is unsupported).
 *
 *    Note also: The following structures are not #define'd with both
 *    little-endian and big-endian definitions.  This is because their
 *    individual fields are not directly accessed except through the macros
 *    defined below.
 */


typedef struct mcxnex_hw_eqe_cq_s {
	uint32_t			:8;
	uint32_t	cqn		:24;
	uint32_t	rsrv0[5];
} mcxnex_hw_eqe_cq_t;



typedef struct mcxnex_hw_eqe_qp_evt_s {
	uint32_t			:8;
	uint32_t	qpn		:24;

	uint32_t	rsrv0[5];
} mcxnex_hw_eqe_qpevt_t;


typedef struct mcxnex_hw_eqe_cqerr_s {
	uint32_t			:8;
	uint32_t	cqn		:24;

	uint32_t			:32;

	uint32_t			:24;
	uint32_t	syndrome	:8;

	uint32_t	rsrv0[3];
} mcxnex_hw_eqe_cqerr_t;
#define	MCXNEX_CQERR_OVERFLOW		0x1
#define	MCXNEX_CQERR_ACCESS_VIOLATION	0x2


typedef struct mcxnex_hw_eqe_portstate_s {
	uint32_t	rsrv0[2];

	uint32_t			:2;
	uint32_t	port		:2;
	uint32_t			:28;

	uint32_t	rsrv1[3];
} mcxnex_hw_eqe_portstate_t;
#define	MCXNEX_PORT_LINK_ACTIVE		0x4
#define	MCXNEX_PORT_LINK_DOWN		0x1


typedef struct mcxnex_hw_eqe_gpio_s {
	uint32_t	rsrv0[3];

	uint32_t	gpio_ev0;

	uint32_t	gpio_ev1;

	uint32_t		:32;
} mcxnex_hw_eqe_gpio_t;


typedef struct mcxnex_hw_eqe_cmdcmpl_s {
	uint32_t			:16;
	uint32_t	token		:16;

	uint32_t			:32;

	uint32_t			:24;
	uint32_t	status	:8;

	uint32_t	out_param0;

	uint32_t	out_param1;

	uint32_t			:32;
} mcxnex_hw_eqe_cmdcmpl_t;


typedef struct mcxnex_hw_eqe_operr_s {
	uint32_t	rsrv0[2];

	uint32_t			:24;
	uint32_t	error_type	:8;

	uint32_t	data;

	uint32_t	rsrv1[2];
} mcxnex_hw_eqe_operr_t;
#define	MCXNEX_ERREVT_EQ_OVERFLOW	0x1
#define	MCXNEX_ERREVT_BAD_UARPG		0x2
#define	MCXNEX_ERREVT_UPLINK_BUSERR	0x3
#define	MCXNEX_ERREVT_DDR_DATAERR	0x4
#define	MCXNEX_ERREVT_INTERNAL_PARITY	0x5


typedef struct mcxnex_hw_eqe_pgflt_s {
	uint32_t	rsrv0[2];
	uint32_t			:24;
	uint32_t	fault_type	:4;
	uint32_t	wqv		:1;
	uint32_t	wqe_data	:1;
	uint32_t	rem_loc		:1;
	uint32_t	snd_rcv		:1;
	uint32_t	vaddr_h;
	uint32_t	vaddr_l;
	uint32_t	mem_key;
} mcxnex_hw_eqe_pgflt_t;
#define	MCXNEX_PGFLT_PG_NOTPRESENT	0x8
#define	MCXNEX_PGFLT_PG_WRACC_VIOL	0xA
#define	MCXNEX_PGFLT_UNSUP_NOTPRESENT	0xE
#define	MCXNEX_PGFLT_UNSUP_WRACC_VIOL	0xF
#define	MCXNEX_PGFLT_WQE_CAUSED		0x1
#define	MCXNEX_PGFLT_DATA_CAUSED		0x0
#define	MCXNEX_PGFLT_REMOTE_CAUSED	0x1
#define	MCXNEX_PGFLT_LOCAL_CAUSED	0x0
#define	MCXNEX_PGFLT_SEND_CAUSED		0x1
#define	MCXNEX_PGFLT_RECV_CAUSED		0x0
#define	MCXNEX_PGFLT_DESC_CONSUMED	0x1
#define	MCXNEX_PGFLT_DESC_NOTCONSUMED	0x0

struct mcxnex_hw_eqe_s {
	uint32_t			:8;
	uint32_t	event_type	:8;
	uint32_t			:8;
	uint32_t	event_subtype	:8;
	union {
		mcxnex_hw_eqe_cq_t		eqe_cq;
		mcxnex_hw_eqe_qpevt_t		eqe_qpevt;
		mcxnex_hw_eqe_cqerr_t		eqe_cqerr;
		mcxnex_hw_eqe_portstate_t	eqe_portstate;
		mcxnex_hw_eqe_gpio_t		eqe_gpio;
		mcxnex_hw_eqe_cmdcmpl_t		eqe_cmdcmpl;
		mcxnex_hw_eqe_operr_t		eqe_operr;
		mcxnex_hw_eqe_pgflt_t		eqe_pgflt;
	} event_data;
	uint32_t			:24;
	uint32_t	owner		:1;
	uint32_t			:7;
};
#define	eqe_cq				event_data.eqe_cq
#define	eqe_qpevt			event_data.eqe_qpevt
#define	eqe_cqerr			event_data.eqe_cqerr
#define	eqe_portstate			event_data.eqe_portstate
#define	eqe_gpio			event_data.eqe_gpio
#define	eqe_cmdcmpl			event_data.eqe_cmdcmpl
#define	eqe_operr			event_data.eqe_operr
#define	eqe_pgflt			event_data.eqe_pgflt

