Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_hw.h
/*
 * The following macros are used for extracting (and in some cases filling in)
 * information from EQEs
 */
#define	MCXNEX_EQE_CQNUM_MASK		0x00FFFFFF
#define	MCXNEX_EQE_CQNUM_SHIFT		0
#define	MCXNEX_EQE_QPNUM_MASK		0x00FFFFFF
#define	MCXNEX_EQE_QPNUM_SHIFT		0
#define	MCXNEX_EQE_PORTNUM_MASK		0x30
#define	MCXNEX_EQE_PORTNUM_SHIFT	4
#define	MCXNEX_EQE_OWNER_MASK		0x00000080
#define	MCXNEX_EQE_OWNER_SHIFT		7

#define	MCXNEX_EQE_EVTTYPE_GET(eq, eqe)					\
	(((uint8_t *)(eqe))[1])
#define	MCXNEX_EQE_EVTSUBTYPE_GET(eq, eqe)				\
	(((uint8_t *)(eqe))[3])
#define	MCXNEX_EQE_CQNUM_GET(eq, eqe)					\
	((htonl(((uint32_t *)(eqe))[1]) & MCXNEX_EQE_CQNUM_MASK) >>	\
	    MCXNEX_EQE_CQNUM_SHIFT)
#define	MCXNEX_EQE_QPNUM_GET(eq, eqe)					\
	((htonl(((uint32_t *)(eqe))[1]) & MCXNEX_EQE_QPNUM_MASK) >>	\
	MCXNEX_EQE_QPNUM_SHIFT)
#define	MCXNEX_EQE_PORTNUM_GET(eq, eqe)					\
	(((((uint8_t *)(eqe))[12]) & MCXNEX_EQE_PORTNUM_MASK) >>	\
	    MCXNEX_EQE_PORTNUM_SHIFT)
#define	MCXNEX_EQE_CMDTOKEN_GET(eq, eqe)				\
	htons(((uint16_t *)(eqe))[3])
#define	MCXNEX_EQE_CMDSTATUS_GET(eq, eqe)				\
	(((uint8_t *)(eqe))[0xf])
#define	MCXNEX_EQE_CMDOUTP0_GET(eq, eqe)				\
	htonl(((uint32_t *)(eqe))[4])
#define	MCXNEX_EQE_CMDOUTP1_GET(eq, eqe)				\
	htonl(((uint32_t *)(eqe))[5])
#define	MCXNEX_EQE_OPERRTYPE_GET(eq, eqe)				\
	(((uint8_t *)(eqe))[0xf])
#define	MCXNEX_EQE_OPERRDATA_GET(eq, eqe)				\
	htonl(((uint32_t *)(eqe))[4])
/*
 * Mcxnex does ownership of CQ and EQ differently from Arbel & Tavor.
 * Now, you keep track of the TOTAL number of CQE's or EQE's that have been
 * processed, and the sense of the ownership bit changes each time through.
 * That is, if the size of the queue is 16, so 4 bits [3:0] are the index
 * number, then bit [4] is the ownership bit in the count.  So you mask that
 * bit and compare it to the owner bit in the entry - if the same, then the
 * entry is in SW onwership.  Otherwise, it's in hardware and the driver
 * does not consume it.
 */

#define	MCXNEX_EQE_OWNER_IS_SW(eq, eqe)					\
	((((uint8_t *)(eqe))[0x1f] & MCXNEX_EQE_OWNER_MASK) ==		\
	    (((eq->eq_nexteqe) & eq->eq_bufsz) >>			\
	    (eq->eq_log_eqsz - MCXNEX_EQE_OWNER_SHIFT)))

/*
 * Mcxnex Completion Queue Context Table (CQC) entries
 *    The CQC table is a virtually-contiguous memory area residing in HCA's
 *    ICM.  Each CQC table entry contains information
 *    required by the hardware to access the completion queue to post
 *    completions (CQE).
 *
 *    The following structure is used in the SW2HW_CQ, QUERY_CQ, RESIZE_CQ,
 *    and HW2SW_CQ commands.
 *    The SW2HW_CQ command transfers ownership of an CQ context from software
 *    to hardware. The command takes the CQC entry from the input mailbox and
 *    stores it in the CQC in the hardware. The command will fail if the
 *    requested CQC entry is already owned by the hardware.
 *    The QUERY_CQ command retrieves a snapshot of a CQC entry. The command
 *    stores the snapshot in the output mailbox.  The CQC state and its values
 *    are not affected by the QUERY_CQ command.
 *    Finally, the HW2SW_CQ command transfers ownership of a CQC entry from
 *    the hardware to the software. The command takes the CQC entry from the
 *    hardware and stores it in the output mailbox. The CQC entry will be
 *    invalidated as a result of the command.
 */


#ifdef	_LITTLE_ENDIAN
struct mcxnex_hw_cqc_s {
	uint32_t			:32;

	uint32_t			:8;
	uint32_t	state		:4;
	uint32_t			:5;
	uint32_t	overrun_ignore	:1;
	uint32_t	cqe_coalesc	:1;
	uint32_t			:9;
	uint32_t	status		:4;

	uint32_t	usr_page	:24;
	uint32_t	log_cq_sz	:5;
	uint32_t			:3;

	uint32_t			:5;
	uint32_t	pg_offs		:7;
	uint32_t			:20;

	uint32_t	c_eqn		:9;
	uint32_t			:23;

	uint32_t	cq_max_cnt	:16;
	uint32_t	cq_period	:16;

	uint32_t			:3;
	uint32_t	mtt_base_addl 	:29;

	uint32_t	mtt_base_addh 	:8;
	uint32_t			:16;
	uint32_t	log2_pgsz	:6;
	uint32_t			:2;

	uint32_t	solicit_prod_indx :24;
	uint32_t				:8;

	uint32_t	last_notified_indx	:24;
	uint32_t				:8;

	uint32_t	prod_cntr		:24;	/* producer counter */
	uint32_t				:8;

	uint32_t	cons_cntr		:24;	/* consumer counter */
	uint32_t				:8;

	uint32_t	rsrv0[2];

	uint32_t				:3;
	uint32_t	dbr_addrl		:29;

	uint32_t	dbr_addrh;

	uint64_t	rsrv1[8];		/* mcxnex, match DEV_CAP size */
};
#else
struct mcxnex_hw_cqc_s {
	uint32_t	status	:4;
	uint32_t			:9;
	uint32_t	cqe_coalesc	:1;
	uint32_t	overrun_ignore	:1;
	uint32_t			:5;
	uint32_t	state		:4;
	uint32_t			:8;

	uint32_t			:32;

	uint32_t			:20;
	uint32_t	pg_offs		:7;
	uint32_t			:5;

	uint32_t			:3;
	uint32_t	log_cq_sz	:5;
	uint32_t	usr_page	:24;

	uint32_t	cq_period	:16;
	uint32_t	cq_max_cnt	:16;

	uint32_t			:23;
	uint32_t	c_eqn		:9;

	uint32_t			:2;
	uint32_t	log2_pgsz	:6;
	uint32_t			:16;
	uint32_t	mtt_base_addh 	:8;

	uint32_t	mtt_base_addl 	:29;
	uint32_t				:3;

	uint32_t				:8;
	uint32_t	last_notified_indx	:24;

	uint32_t				:8;
	uint32_t	solicit_prod_indx	:24;

	uint32_t				:8;
	uint32_t	cons_cntr		:24;	/* consumer counter */

	uint32_t				:8;
	uint32_t	prod_cntr		:24;	/* priducer counter */

	uint32_t	rsrv0[2];

	uint32_t	dbr_addrh;

	uint32_t	dbr_addrl		:29;
	uint32_t				:3;

	uint64_t	rsrv1[8];		/* mcxnex, match DEV_CAP size */
};
#endif
#define	MCXNEX_CQ_STATUS_OK		0x0
#define	MCXNEX_CQ_STATUS_OVERFLOW	0x9
#define	MCXNEX_CQ_STATUS_WRITE_FAILURE	0xA

#define	MCXNEX_CQ_DISARMED		0x0
#define	MCXNEX_CQ_ARMED			0x1
#define	MCXNEX_CQ_ARMED_SOLICITED	0x4
#define	MCXNEX_CQ_FIRED			0xA

/*
 * Mcxnex Completion Queue Entries (CQE)
 *    Each CQE contains enough information for the software to associate the
 *    completion with the Work Queue Element (WQE) to which it corresponds.
 *
 *    Note: The following structure is not #define'd with both little-endian
 *    and big-endian definitions.  This is because each CQE's individual
 *    fields are not directly accessed except through the macros defined below.
 */


struct mcxnex_hw_cqe_s {
	uint32_t	dife		:1;
	uint32_t	vlan		:2;
	uint32_t	fl		:1;
	uint32_t	fccrc_sd	:1;
	uint32_t	d2s		:1;
	uint32_t			:2;
	uint32_t	my_qpn		:24;

	uint32_t	immed_rss_val_key;

	uint32_t	grh		:1;
	uint32_t	ml_path		:7;
	uint32_t	srq_rqpn	:24;

	uint32_t	sl		:4;
	uint32_t	vid		:12;
	uint32_t	slid		:16;

	uint32_t	ipoib_status;

