Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_hw.h
	uint32_t	byte_cnt;

	uint32_t	wqe_cntr	:16;
	uint32_t	checksum	:16;

	uint32_t			:8;
	uint32_t			:16;
	uint32_t	owner		:1;
	uint32_t	send_or_recv	:1;
	uint32_t	inline_scatter	:1;
	uint32_t	opcode		:5;
};
#define	MCXNEX_COMPLETION_RECV		0x0
#define	MCXNEX_COMPLETION_SEND		0x1

#define	MCXNEX_CQE_DEFAULT_VERSION	0x0

/*
 * The following macros are used for extracting (and in some cases filling in)
 * information from CQEs
 */
#define	MCXNEX_CQE_QPNUM_MASK		0x00FFFFFF
#define	MCXNEX_CQE_QPNUM_SHIFT		0


#define	MCXNEX_CQE_DQPN_MASK		0x00FFFFFF
#define	MCXNEX_CQE_DQPN_SHIFT		0


#define	MCXNEX_CQE_SL_SHIFT		4
#define	MCXNEX_CQE_GRH_MASK		0x80
#define	MCXNEX_CQE_PATHBITS_MASK	0x7F
#define	MCXNEX_CQE_SLID_15_8		0xe
#define	MCXNEX_CQE_SLID_7_0		0xf
#define	MCXNEX_CQE_OPCODE_MASK		0x1F
#define	MCXNEX_CQE_SENDRECV_MASK	0x40
#define	MCXNEX_CQE_SENDRECV_SHIFT	6
#define	MCXNEX_CQE_OWNER_MASK		0x80
#define	MCXNEX_CQE_OWNER_SHIFT		7
#define	MCXNEX_CQE_WQECNTR_15_8		0x18
#define	MCXNEX_CQE_WQECNTR_7_0		0x19
/* Byte offsets for IPoIB Checksum Offload fields */
#define	MCXNEX_CQE_CKSUM_15_8		0x1a
#define	MCXNEX_CQE_CKSUM_7_0		0x1b
#define	MCXNEX_CQE_IPOK			0x10	/* byte 0x10 in cqe */
#define	MCXNEX_CQE_IPOK_BIT		0x10	/* bitmask for OK bit */
#define	MCXNEX_CQE_TCPUDP_BITS		0x0c	/* bitmask for TCP/UDP bits */

#define	MCXNEX_CQE_IS_VLAN(cq, cqe)					\
	(((uint8_t *)(cqe))[0] & 0x20)
#define	MCXNEX_CQE_VLANID(cq, cqe)					\
	((uint16_t *)(cqe))[6]

#define	MCXNEX_CQE_IS_IPOK(cq, cqe)					\
	(((uint8_t *)(cqe))[MCXNEX_CQE_IPOK] & MCXNEX_CQE_IPOK_BIT)

#define	MCXNEX_CQE_IS_TCPUDP(cq, cqe)					\
	(((uint8_t *)(cqe))[MCXNEX_CQE_IPOK] & MCXNEX_CQE_TCPUDP_BITS)

#define	MCXNEX_CQE_CKSUM(cq, cqe)					\
	((((uint8_t *)(cqe))[MCXNEX_CQE_CKSUM_15_8] << 8) |		\
	    (((uint8_t *)(cqe))[MCXNEX_CQE_CKSUM_7_0]))

#define	MCXNEX_CQE_IPOIB_STATUS(cq, cqe)				\
	htonl((((uint32_t *)(cqe)))[4])

#define	MCXNEX_CQE_QPNUM_GET(cq, cqe)					\
	((htonl((((uint32_t *)(cqe)))[0]) & MCXNEX_CQE_QPNUM_MASK) >>	\
	    MCXNEX_CQE_QPNUM_SHIFT)

#define	MCXNEX_CQE_IMM_ETH_PKEY_CRED_GET(cq, cqe)			\
	htonl(((uint32_t *)(cqe))[1])

#define	MCXNEX_CQE_DQPN_GET(cq, cqe)					\
	((htonl(((uint32_t *)(cqe))[2]) & MCXNEX_CQE_DQPN_MASK) >>	\
	    MCXNEX_CQE_DQPN_SHIFT)

#define	MCXNEX_CQE_GRH_GET(cq, cqe)					\
	(((uint8_t *)(cqe))[8] & MCXNEX_CQE_GRH_MASK)

#define	MCXNEX_CQE_PATHBITS_GET(cq, cqe)				\
	(((uint8_t *)(cqe))[8] & MCXNEX_CQE_PATHBITS_MASK)

#define	MCXNEX_CQE_DLID_GET(cq, cqe)					\
	((((uint8_t *)(cqe))[MCXNEX_CQE_SLID_15_8] << 8) |		\
	    (((uint8_t *)(cqe))[MCXNEX_CQE_SLID_7_0]))

#define	MCXNEX_CQE_SL_GET(cq, cqe)					\
	((((uint8_t *)(cqe))[12]) >> MCXNEX_CQE_SL_SHIFT)

#define	MCXNEX_CQE_BYTECNT_GET(cq, cqe)					\
	htonl(((uint32_t *)(cqe))[5])

#define	MCXNEX_CQE_WQECNTR_GET(cq, cqe)					\
	((((uint8_t *)(cqe))[MCXNEX_CQE_WQECNTR_15_8] << 8) |		\
	    (((uint8_t *)(cqe))[MCXNEX_CQE_WQECNTR_7_0]))

#define	MCXNEX_CQE_ERROR_SYNDROME_GET(cq, cqe)				\
	(((uint8_t *)(cqe))[27])

#define	MCXNEX_CQE_OPCODE_GET(cq, cqe)					\
	((((uint8_t *)(cqe))[31]) & MCXNEX_CQE_OPCODE_MASK)

#define	MCXNEX_CQE_SENDRECV_GET(cq, cqe)				\
	(((((uint8_t *)(cqe))[31]) & MCXNEX_CQE_SENDRECV_MASK) >>	\
	    MCXNEX_CQE_SENDRECV_SHIFT)

/* See Comment above for EQE - ownership of CQE is handled the same */

#define	MCXNEX_CQE_OWNER_IS_SW(cq, cqe, considx)			\
	(((((uint8_t *)(cqe))[31] & MCXNEX_CQE_OWNER_MASK) >>		\
	    MCXNEX_CQE_OWNER_SHIFT) == 					\
	    (((considx) & cq->cq_bufsz) >> cq->cq_log_cqsz))

/*
 * Mcxnex Shared Receive Queue (SRQ) Context Entry Format
 */

#ifdef _LITTLE_ENDIAN
struct mcxnex_hw_srqc_s {
	uint32_t	xrc_domain		:16;
	uint32_t				:8;
	uint32_t	log_rq_stride		:3;
	uint32_t				:5;

	uint32_t	srqn			:24;
	uint32_t	log_srq_size		:4;
	uint32_t	state			:4;

	uint32_t				:32;

	uint32_t	cqn_xrc			:24;
	uint32_t				:2;
	uint32_t	page_offs		:6;

	uint32_t				:3;
	uint32_t	mtt_base_addrl		:29;

	uint32_t	mtt_base_addrh		:8;
	uint32_t				:16;
	uint32_t	log2_pgsz		:6;
	uint32_t				:2;

	uint32_t	wqe_cnt			:16;
	uint32_t	lwm			:16;

	uint32_t	pd			:24;
	uint32_t				:8;

	uint32_t				:32;

	uint32_t	srq_wqe_cntr		:16;
	uint32_t				:16;

	uint32_t				:2;
	uint32_t	dbr_addrl		:30;

	uint32_t	dbr_addrh;

	uint32_t	rsrc0[80];	/* to match DEV_CAP size of 0x80 */

};
#else
struct mcxnex_hw_srqc_s {
	uint32_t	state			:4;
	uint32_t	log_srq_size		:4;
	uint32_t	srqn			:24;

	uint32_t				:5;
	uint32_t	log_rq_stride		:3;
	uint32_t				:8;
	uint32_t	xrc_domain		:16;

	uint32_t	page_offs		:6;
	uint32_t				:2;
	uint32_t	cqn_xrc			:24;

	uint32_t				:32;

	uint32_t				:2;
	uint32_t	log2_pgsz		:6;
	uint32_t				:16;
	uint32_t	mtt_base_addrh		:8;

	uint32_t	mtt_base_addrl		:29;
	uint32_t				:3;

	uint32_t				:8;
	uint32_t	pd			:24;

	uint32_t	lwm			:16;
	uint32_t	wqe_cnt			:16;

	uint32_t				:16;
	uint32_t	srq_wqe_cntr		:16;

	uint32_t				:32;

	uint32_t	dbr_addrh;

	uint32_t	dbr_addrl		:30;
	uint32_t				:2;

	uint32_t	rsrc0[80];	/* to match DEV_CAP size of 0x80 */
};
#endif

/*
 * Mcxnex MOD_STAT_CFG input mailbox structure
 */


#ifdef _LITTLE_ENDIAN
struct mcxnex_hw_mod_stat_cfg_s {
	uint32_t	rsvd0;

	uint32_t				:14;
	uint32_t	dife			:1;
	uint32_t	dife_m			:1;
	uint32_t	rx_options		:4;
	uint32_t				:3;
	uint32_t	rx_options_m		:1;
	uint32_t	tx_options		:4;
	uint32_t				:3;
	uint32_t	tx_options_m		:1;

	uint32_t	lid			:16;
	uint32_t	lid_m			:1;
	uint32_t				:3;
	uint32_t	port_en			:1;
	uint32_t	port_en_m		:1;
	uint32_t				:10;

	uint32_t	rsvd1;

	uint32_t	guid_hi;

	uint32_t				:31;
	uint32_t	guid_hi_m		:1;

	uint32_t	guid_lo;
	uint32_t				:31;

	uint32_t	guid_lo_m		:1;

	uint32_t	rsvd[4];

	uint32_t	inbuf_ind_en		:3;
	uint32_t				:1;
	uint32_t	sd_main			:4;
	uint32_t				:4;
	uint32_t	sd_equal		:4;
	uint32_t				:4;
	uint32_t	sd_mux_main		:2;
	uint32_t				:2;
	uint32_t	mux_eq			:2;
	uint32_t				:2;
	uint32_t	sigdet_th		:3;
	uint32_t				:1;

	uint32_t	ob_preemp_pre		:5;
	uint32_t				:3;
	uint32_t	op_preemp_post		:5;
	uint32_t				:3;
	uint32_t	ob_preemp_main		:5;
	uint32_t				:3;
	uint32_t	ob_preemp		:5;
	uint32_t				:2;
	uint32_t	serdes_m		:1;

	uint32_t	reserved[50];
};
#else /* BIG ENDIAN */
struct mcxnex_hw_mod_stat_cfg_s {
	uint32_t	tx_options_m		:1;
	uint32_t				:3;
	uint32_t	tx_options		:4;
	uint32_t	rx_options_m		:1;
	uint32_t				:3;
	uint32_t	rx_options		:4;
	uint32_t	dife_m			:1;
	uint32_t	dife			:1;
	uint32_t				:14;

