Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_hw.h
	uint32_t	rsvd0;

	uint32_t	rsvd1;

	uint32_t				:10;
	uint32_t	port_en_m		:1;
	uint32_t	port_en			:1;
	uint32_t				:3;
	uint32_t	lid_m			:1;
	uint32_t	lid			:16;

	uint32_t	guid_hi_m		:1;
	uint32_t				:31;

	uint32_t	guid_hi;

	uint32_t	guid_lo_m		:1;
	uint32_t				:31;

	uint32_t	guid_lo;

	uint32_t	rsvd[4];

	uint32_t	serdes_m		:1;
	uint32_t				:2;
	uint32_t	ob_preemp		:5;
	uint32_t				:3;
	uint32_t	ob_preemp_main		:5;
	uint32_t				:3;
	uint32_t	op_preemp_post		:5;
	uint32_t				:3;
	uint32_t	ob_preemp_pre		:5;

	uint32_t				:1;
	uint32_t	sigdet_th		:3;
	uint32_t				:2;
	uint32_t	mux_eq			:2;
	uint32_t				:2;
	uint32_t	sd_mux_main		:2;
	uint32_t				:4;
	uint32_t	sd_equal		:4;
	uint32_t				:4;
	uint32_t	sd_main			:4;
	uint32_t				:1;
	uint32_t	inbuf_ind_en		:3;

	uint32_t	reserved[50];
};
#endif


/*
 * Mcxnex MOD_STAT_CFG input modifier structure
 */
struct mcxnex_hw_msg_in_mod_s {
#ifdef _LITTLE_ENDIAN
	uint32_t	offset			:8;
	uint32_t	port_num		:8;
	uint32_t	lane_num		:4;
	uint32_t	link_speed		:3;
	uint32_t	auto_neg		:1;
	uint32_t				:4;
	uint32_t	setup_mode		:4;
#else
	uint32_t	setup_mode		:4;
	uint32_t				:4;
	uint32_t	auto_neg		:1;
	uint32_t	link_speed		:3;
	uint32_t	lane_num		:4;
	uint32_t	port_num		:8;
	uint32_t	offset			:8;
#endif
};

typedef union {
	uint32_t			data;
	struct mcxnex_hw_msg_in_mod_s	mod;
} mcxnex_hw_msg_in_mod_t;

/*
 * Mcxnex UD Address Vector (UDAV)
 *    Mcxnex UDAV are used in conjunction with Unreliable Datagram (UD) send
 *    WQEs. Each UD send message contains an address vector in in the datagram
 *    segment. The verbs consumer must use special verbs to create and modify
 *    address handles, each of which contains a UDAV structure.  When posting
 *    send WQEs to UD QP, the verbs consumer must supply a valid address
 *    handle/UDAV.
 */


#ifdef	_LITTLE_ENDIAN
struct mcxnex_hw_udav_s {
	uint32_t	rlid		:16;
	uint32_t	ml_path		:7;
	uint32_t	grh		:1;
	uint32_t			:8;

	uint32_t	pd		:24;
	uint32_t	portnum		:2;
	uint32_t			:5;
	uint32_t	force_lp	:1;

	uint32_t	flow_label	:20;
	uint32_t	tclass		:8;
	uint32_t	sl		:4;

	uint32_t	hop_limit	:8;
	uint32_t	max_stat_rate	:4;
	uint32_t			:4;
	uint32_t	mgid_index	:7;
	uint32_t			:9;

	uint64_t	rgid_h;
	uint64_t	rgid_l;
};
#else
struct mcxnex_hw_udav_s {
	uint32_t	force_lb	:1;
	uint32_t			:5;
	uint32_t	portnum		:2;
	uint32_t	pd		:24;

	uint32_t			:8;
	uint32_t	grh		:1;
	uint32_t	ml_path		:7;
	uint32_t	rlid		:16;

	uint32_t			:9;
	uint32_t	mgid_index	:7;
	uint32_t			:4;
	uint32_t	max_stat_rate	:4;
	uint32_t	hop_limit	:8;

	uint32_t	sl		:4;
	uint32_t	tclass		:8;
	uint32_t	flow_label	:20;

	uint64_t	rgid_h;
	uint64_t	rgid_l;
};
#endif
#define	MCXNEX_UDAV_MODIFY_MASK0		0xFCFFFFFFFF000000ULL
#define	MCXNEX_UDAV_MODIFY_MASK1		0xFF80F00000000000ULL


/*
 * Mcxnex Queue Pair Context Table (QPC) entries
 *    The QPC table is a virtually-contiguous memory area residing in HCA
 *    ICM.  Each QPC entry is accessed for reads and writes
 *    by the HCA while executing work requests on the associated QP.
 *
 *    The following structure is used in the RST2INIT_QP, INIT2INIT_QP,
 *    INIT2RTR_QP, RTR2RTS_QP, RTS2RTS_QP, SQERR2RTS_QP, TOERR_QP, RTS2SQD_QP,
 *    SQD2RTS_QP, TORST_QP, and QUERY_QP commands.
 *    With the exception of the QUERY_QP command, each of these commands reads
 *    from some portion of the QPC in the input mailbox and modified the QPC
 *    stored in the hardware.  The QUERY_QP command retrieves a snapshot of a
 *    QPC entry. The command stores the snapshot in the output mailbox.  The
 *    QPC state and its values are not affected by the QUERY_QP command.
 *
 *    Below we first define the mcxnex_hw_addr_path_t or "Mcxnex Address Path"
 *    structure.  This structure is used to provide address path information
 *    (both primary and secondary) for each QP context.  Note:  Since this
 *    structure is _very_ similar to the mcxnex_hw_udav_t structure above,
 *    we are able to leverage the similarity with filling in and reading from
 *    the two types of structures.  See mcxnex_get_addr_path() and
 *    mcxnex_set_addr_path() in mcxnex_misc.c for more details.
 */
#if (DATAMODEL_NATIVE == DATAMODEL_LP64)
#pragma pack(4)
#endif

#ifdef	_LITTLE_ENDIAN
struct mcxnex_hw_addr_path_s {
	uint32_t	rlid		:16;
	uint32_t	mlid		:7;
	uint32_t	grh		:1;
	uint32_t	cntr_idx	:8;

	uint32_t	pkey_indx	:7;
	uint32_t			:22;
	uint32_t			:1;	/* but may be used for enet */
	uint32_t	cvlan		:1;	/* but may be used for enet */
	uint32_t	force_lb	:1;

	uint32_t	flow_label	:20;
	uint32_t	tclass		:8;
	uint32_t	sniff_s_ing	:1;
	uint32_t	sniff_s_egr	:1;
	uint32_t	sniff_r_ing	:1;
	uint32_t	sniff_r_egr	:1;

	uint32_t	hop_limit	:8;
	uint32_t	max_stat_rate	:4;
	uint32_t			:4;
	uint32_t	mgid_index	:7;
	uint32_t			:1;
	uint32_t	link_type	:3;
	uint32_t	ack_timeout	:4;

	uint64_t	rgid_h;
	uint64_t	rgid_l;

	uint32_t			:32;	/* but may be used for enet */

	uint32_t			:12;	/* but may be used for enet */
	uint32_t	fsip		:1;
	uint32_t			:3;
	uint32_t			:7;
	uint32_t			:1;
	uint32_t	sched_q		:8;


	uint32_t			:32;
};
#else
struct mcxnex_hw_addr_path_s {
	uint32_t	force_lb	:1;
	uint32_t			:2;	/* but may be used for enet */
	uint32_t			:22;
	uint32_t	pkey_indx	:7;

	uint32_t	cntr_idx	:8;
	uint32_t	grh		:1;
	uint32_t	mlid		:7;
	uint32_t	rlid		:16;

	uint32_t	ack_timeout	:4;
	uint32_t	link_type	:3;
	uint32_t			:1;
	uint32_t	mgid_index	:7;
	uint32_t			:4;
	uint32_t	max_stat_rate	:4;
	uint32_t	hop_limit	:8;

	uint32_t	sniff_r_egr	:1;
	uint32_t	sniff_r_ing	:1;
	uint32_t	sniff_s_egr	:1;
	uint32_t	sniff_s_ing	:1;
	uint32_t	tclass		:8;
	uint32_t	flow_label	:20;

	uint64_t	rgid_h;
	uint64_t	rgid_l;

	uint32_t	sched_q		:8;
	uint32_t			:1;
	uint32_t			:7;
	uint32_t			:3;
	uint32_t	fsip		:1;
	uint32_t			:12;	/* but may be used for enet */

	uint32_t			:32;	/* but may be used for enet */

	uint32_t			:32;
};
#endif	/* LITTLE ENDIAN */

#if (DATAMODEL_NATIVE == DATAMODEL_LP64)
#pragma pack()
#endif

#if (DATAMODEL_NATIVE == DATAMODEL_LP64)
#pragma pack(4)
#endif
#ifdef	_LITTLE_ENDIAN
struct mcxnex_hw_qpc_s {
	uint32_t	pd		:24;
	uint32_t			:8;

	uint32_t			:11;
	uint32_t	pm_state	:2;
	uint32_t	rss		:1;
	uint32_t			:2;
	uint32_t	serv_type	:8;
	uint32_t			:4;
	uint32_t	state		:4;

	uint32_t	usr_page	:24;
	uint32_t			:8;

	uint32_t			:4;
	uint32_t	rlky		:1;
	uint32_t			:3;
	uint32_t	log_sq_stride	:3;
	uint32_t	log_sq_size	:4;
	uint32_t	sq_no_prefetch	:1;
	uint32_t	log_rq_stride	:3;
	uint32_t	log_rq_size	:4;
	uint32_t			:1;
	uint32_t	msg_max		:5;
	uint32_t	mtu		:3;

	uint32_t	rem_qpn		:24;
	uint32_t			:8;

	uint32_t	loc_qpn		:24;
	uint32_t			:8;

	mcxnex_hw_addr_path_t	pri_addr_path;

	mcxnex_hw_addr_path_t	alt_addr_path;

	uint32_t			:32;

