Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_hw.h
	uint32_t			:5;
	uint32_t	cur_retry_cnt	:3;
	uint32_t	cur_rnr_retry	:3;
	uint32_t	fre		:1;
	uint32_t			:1;
	uint32_t	rnr_retry	:3;
	uint32_t	retry_cnt	:3;
	uint32_t			:2;
	uint32_t	sra_max		:3;
	uint32_t			:4;
	uint32_t	ack_req_freq	:4;

	uint32_t	cqn_snd		:24;
	uint32_t			:8;

	uint32_t	next_snd_psn	:24;
	uint32_t			:8;

	uint32_t			:32;

	uint32_t			:32;

	uint32_t	ssn		:24;
	uint32_t			:8;

	uint32_t	last_acked_psn	:24;
	uint32_t			:8;

	uint32_t	next_rcv_psn	:24;
	uint32_t	min_rnr_nak	:5;
	uint32_t			:3;

	uint32_t			:4;
	uint32_t	ric		:1;
	uint32_t			:1;
	uint32_t	page_offs	:6;
	uint32_t			:1;
	uint32_t	rae		:1;
	uint32_t	rwe		:1;
	uint32_t	rre		:1;
	uint32_t			:5;
	uint32_t	rra_max		:3;
	uint32_t			:8;

	uint32_t	cqn_rcv		:24;
	uint32_t			:8;

	uint32_t	srcd		:16;
	uint32_t			:16;

	uint32_t			:2;
	uint32_t	dbr_addrl	:30;

	uint32_t	dbr_addrh	:32;

	uint32_t	srq_number	:24;
	uint32_t	srq_en		:1;
	uint32_t			:7;

	uint32_t	qkey;

	uint32_t	sq_wqe_counter	:16;
	uint32_t	rq_wqe_counter	:16;

	uint32_t	rmsn		:24;
	uint32_t			:8;

	uint32_t	rsrv0[2];

	/* new w/ mcxnex */

	uint32_t	base_mkey	:24;	/* bits 32-8, low 7 m/b 0 */
	uint32_t	num_rmc_peers	:8;

	uint32_t	rmc_parent_qpn	:24;
	uint32_t	header_sep	:1;
	uint32_t	inline_scatter :1; /* m/b 0 for srq */
	uint32_t			:1;
	uint32_t	rmc_enable	:2;
	uint32_t			:1;	/* may use one bit for enet */
	uint32_t	vlan_strip_off	:1;
	uint32_t	mkey_remap	:1;

	uint32_t			:3;
	uint32_t	mtt_base_addrl	:29;

	uint32_t	mtt_base_addrh	:8;
	uint32_t			:16;
	uint32_t	log2_pgsz	:6;
	uint32_t			:2;

	uint32_t	rsvd[12];		/* may/will be used for FCoIB */
};
#else /* BIG ENDIAN */
struct mcxnex_hw_qpc_s {
	uint32_t	state		:4;
	uint32_t			:4;
	uint32_t	serv_type	:8;
	uint32_t			:2;
	uint32_t	rss		:1;
	uint32_t	pm_state	:2;
	uint32_t			:11;

	uint32_t			:8;
	uint32_t	pd		:24;

	uint32_t	mtu		:3;
	uint32_t	msg_max		:5;
	uint32_t			:1;
	uint32_t	log_rq_size	:4;
	uint32_t	log_rq_stride	:3;
	uint32_t	sq_no_prefetch	:1;
	uint32_t	log_sq_size	:4;
	uint32_t	log_sq_stride	:3;
	uint32_t			:3;
	uint32_t	rlky		:1;
	uint32_t			:4;

	uint32_t			:8;
	uint32_t	usr_page	:24;

	uint32_t			:8;
	uint32_t	loc_qpn		:24;

	uint32_t			:8;
	uint32_t	rem_qpn		:24;

	mcxnex_hw_addr_path_t	pri_addr_path;

	mcxnex_hw_addr_path_t	alt_addr_path;

	uint32_t	ack_req_freq	:4;
	uint32_t			:4;
	uint32_t	sra_max		:3;
	uint32_t			:2;
	uint32_t	retry_cnt	:3;
	uint32_t	rnr_retry	:3;
	uint32_t			:1;
	uint32_t	fre		:1;
	uint32_t	cur_rnr_retry	:3;
	uint32_t	cur_retry_cnt	:3;
	uint32_t			:5;

	uint32_t			:32;

	uint32_t			:8;
	uint32_t	next_snd_psn	:24;

	uint32_t			:8;
	uint32_t	cqn_snd		:24;

	uint32_t			:32;

	uint32_t			:32;

	uint32_t			:8;
	uint32_t	last_acked_psn	:24;

	uint32_t			:8;
	uint32_t	ssn		:24;

	uint32_t			:8;
	uint32_t	rra_max		:3;
	uint32_t			:5;
	uint32_t	rre		:1;
	uint32_t	rwe		:1;
	uint32_t	rae		:1;
	uint32_t			:1;
	uint32_t	page_offs	:6;
	uint32_t			:1;
	uint32_t	ric		:1;
	uint32_t			:4;

	uint32_t			:3;
	uint32_t	min_rnr_nak	:5;
	uint32_t	next_rcv_psn	:24;

	uint32_t			:16;
	uint32_t	srcd		:16;

	uint32_t			:8;
	uint32_t	cqn_rcv		:24;

	uint32_t	dbr_addrh	:32;

	uint32_t	dbr_addrl	:30;
	uint32_t			:2;

	uint32_t	qkey;

	uint32_t			:7;
	uint32_t	srq_en		:1;
	uint32_t	srq_number	:24;

	uint32_t			:8;
	uint32_t	rmsn		:24;

	uint32_t	rq_wqe_counter	:16;
	uint32_t	sq_wqe_counter	:16;

	uint32_t	rsrv0[2];

	/* new w/ mcxnex */

	uint32_t	mkey_remap	:1;
	uint32_t	vlan_strip_off	:1;
	uint32_t			:1;	/* may use one bit for enet */
	uint32_t	rmc_enable	:2;
	uint32_t			:1;
	uint32_t	inline_scatter :1; /* m/b 0 for srq */
	uint32_t	header_sep	:1;
	uint32_t	rmc_parent_qpn	:24;

	uint32_t	num_rmc_peers	:8;
	uint32_t	base_mkey	:24;	/* bits 32-8, low 7 m/b 0 */

	uint32_t			:2;
	uint32_t	log2_pgsz	:6;
	uint32_t			:16;
	uint32_t	mtt_base_addrh	:8;

	uint32_t	mtt_base_addrl	:29;
	uint32_t			:3;

	uint32_t	rsvd[12];		/* may/will be used for FCoIB */
};
#endif	/* LITTLE ENDIAN */

#if (DATAMODEL_NATIVE == DATAMODEL_LP64)
#pragma pack()
#endif

#define	MCXNEX_QP_LINK_TYPE_IB		0x0
#define	MCXNEX_QP_LINK_TYPE_ETH		0x1

#define	MCXNEX_QP_RESET			0x0
#define	MCXNEX_QP_INIT			0x1
#define	MCXNEX_QP_RTR			0x2
#define	MCXNEX_QP_RTS			0x3
#define	MCXNEX_QP_SQERR			0x4
#define	MCXNEX_QP_SQD			0x5
#define	MCXNEX_QP_ERR			0x6
#define	MCXNEX_QP_SQDRAINING		0x7

#define	MCXNEX_QP_RC			0x0
#define	MCXNEX_QP_UC			0x1
#define	MCXNEX_QP_UD			0x3
#define	MCXNEX_QP_MLX			0x7

#define	MCXNEX_QP_PMSTATE_MIGRATED	0x3
#define	MCXNEX_QP_PMSTATE_ARMED		0x0
#define	MCXNEX_QP_PMSTATE_REARM		0x1

#define	MCXNEX_QP_DESC_EVT_DISABLED	0x0
#define	MCXNEX_QP_DESC_EVT_ENABLED	0x1

#define	MCXNEX_QP_FLIGHT_LIM_UNLIMITED	0xF

#define	MCXNEX_QP_SQ_ALL_SIGNALED	0x1
#define	MCXNEX_QP_SQ_WR_SIGNALED		0x0
#define	MCXNEX_QP_RQ_ALL_SIGNALED	0x1
#define	MCXNEX_QP_RQ_WR_SIGNALED		0x0

#define	MCXNEX_QP_SRQ_ENABLED	0x1
#define	MCXNEX_QP_SRQ_DISABLED	0x0

#define	MCXNEX_QP_WQE_BASE_SHIFT		0x6

/*
 * Mcxnex Multicast Group Member (MCG)
 *    Mcxnex MCG are organized in a virtually-contiguous memory table (the
 *    Multicast Group Table) in the ICM.  This table is
 *    actually comprised of two consecutive tables: the Multicast Group Hash
 *    Table (MGHT) and the Additional Multicast Group Members Table (AMGM).
 *    Each such entry contains an MGID and a list of QPs that are attached to
 *    the multicast group.  Each such entry may also include an index to an
 *    Additional Multicast Group Member Table (AMGM) entry.  The AMGMs are
 *    used to form a linked list of MCG entries that all map to the same hash
 *    value.  The MCG entry size is configured through the INIT_HCA command.
 *    Note:  An MCG actually consists of a single mcxnex_hw_mcg_t and some
 *    number of mcxnex_hw_mcg_qp_list_t (such that the combined structure is a
 *    power-of-2).
 *
 *    The following structures are used in the READ_MGM and WRITE_MGM commands.
 *    The READ_MGM command reads an MCG entry from the multicast table and
 *    returns it in the output mailbox.  Note: This operation does not affect
 *    the MCG entry state or values.
 *    The WRITE_MGM command retrieves an MCG entry from the input mailbox and
 *    stores it in the multicast group table at the index specified in the
 *    command.  Once the command has finished execution, the multicast group
 *    table is updated.  The old entry contents are lost.
 */
#ifdef	_LITTLE_ENDIAN
struct mcxnex_hw_mcg_s {
	uint32_t	member_cnt	:24;
	uint32_t			:8;

	uint32_t			:6;
	uint32_t	next_gid_indx	:26;

	uint32_t			:32;
	uint32_t			:32;

	uint64_t	mgid_h;
	uint64_t	mgid_l;
};
#else
struct mcxnex_hw_mcg_s {
	uint32_t	next_gid_indx	:26;
	uint32_t			:6;

	uint32_t			:8;
	uint32_t	member_cnt	:24;

	uint32_t			:32;
	uint32_t			:32;

	uint64_t	mgid_h;
	uint64_t	mgid_l;
};
#endif


