Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_hw.h
/* Multicast Group Member - QP List entries */
#ifdef	_LITTLE_ENDIAN
struct mcxnex_hw_mcg_qp_list_s {
	uint32_t	qpn		:24;
	uint32_t			:6;
	uint32_t	blk_lb		:1;
	uint32_t			:1;
};
#else
struct mcxnex_hw_mcg_qp_list_s {
	uint32_t			:1;
	uint32_t	blk_lb		:1;
	uint32_t			:6;
	uint32_t	qpn		:24;
};
#endif

#define	MCXNEX_MCG_QPN_BLOCK_LB		0x40000000

/*
 * Structure for getting the peformance counters from the HCA
 */

#ifdef _LITTLE_ENDIAN
struct mcxnex_hw_sm_perfcntr_s {
	uint32_t	linkdown	:8;
	uint32_t	linkerrrec	:8;
	uint32_t	symerr		:16;

	uint32_t	cntrsel		:16;
	uint32_t	portsel		:8;
	uint32_t			:8;

	uint32_t	portxmdiscard	:16;
	uint32_t	portrcvswrelay	:16;

	uint32_t	portrcvrem	:16;
	uint32_t	portrcv		:16;

	uint32_t	vl15drop	:16;
	uint32_t			:16;

	uint32_t	xsbuffovrun	:4;
	uint32_t	locallinkint	:4;
	uint32_t			:8;
	uint32_t	portrcconstr	:8;
	uint32_t	portxmconstr	:8;

	uint32_t	portrcdata;

	uint32_t	portxmdata;

	uint32_t	portrcpkts;

	uint32_t	portxmpkts;

	uint32_t	reserved;

	uint32_t	portxmwait;
};
#else	/* BIG ENDIAN */
struct mcxnex_hw_sm_perfcntr_s {
	uint32_t			:8;
	uint32_t	portsel		:8;
	uint32_t	cntrsel		:16;

	uint32_t	symerr		:16;
	uint32_t	linkerrrec	:8;
	uint32_t	linkdown	:8;

	uint32_t	portrcv		:16;
	uint32_t	portrcvrem	:16;

	uint32_t	portrcvswrelay	:16;
	uint32_t	portxmdiscard	:16;

	uint32_t	portxmconstr	:8;
	uint32_t	portrcconstr	:8;
	uint32_t			:8;
	uint32_t	locallinkint	:4;
	uint32_t	xsbuffovrun	:4;

	uint32_t			:16;
	uint32_t	vl15drop	:16;

	uint32_t	portxmdata;

	uint32_t	portrcdata;

	uint32_t	portxmpkts;

	uint32_t	portrcpkts;

	uint32_t	portxmwait;

	uint32_t	reserved;
};
#endif

/*
 * Structure for getting the extended peformance counters from the HCA
 */

#ifdef _LITTLE_ENDIAN
struct mcxnex_hw_sm_extperfcntr_s {
	uint32_t	rsvd;
	uint32_t	cntrsel		:16;
	uint32_t	portsel		:8;
	uint32_t			:8;

	uint64_t	portxmdata;

	uint64_t	portrcdata;

	uint64_t	portxmpkts;

	uint64_t	portrcpkts;

	uint64_t	portunicastxmpkts;

	uint64_t	portunicastrcpkts;

	uint64_t	portmulticastxmpkts;

	uint64_t	portmulticastrcpkts;
};
#else	/* BIG ENDIAN */
struct mcxnex_hw_sm_extperfcntr_s {
	uint32_t			:8;
	uint32_t	portsel		:8;
	uint32_t	cntrsel		:16;
	uint32_t	rsvd;

	uint64_t	portxmdata;

	uint64_t	portrcdata;

	uint64_t	portxmpkts;

	uint64_t	portrcpkts;

	uint64_t	portunicastxmpkts;

	uint64_t	portunicastrcpkts;

	uint64_t	portmulticastxmpkts;

	uint64_t	portmulticastrcpkts;
};
#endif


/*
 * Mcxnex User Access Region (UAR)
 *
 *	JBDB :  writeup on the UAR for memfree
 *
 *	JBDB :  writeup on the structures
 *		UAR page
 *		DB register
 *		DB record
 *		UCE
 *
 * [es] and change it even further for mcxnex
 * the whole UAR and doorbell record (dbr) approach is changed again
 * from arbel, and needs commenting
 *
 * --  Tavor comment
 *
 *
 *    Tavor doorbells are each rung by writing to the doorbell registers that
 *    form a User Access Region (UAR).  A doorbell is a write-only hardware
 *    register which enables passing information from software to hardware
 *    with minimum software latency. A write operation from the host software
 *    to these doorbell registers passes information about the HCA resources
 *    and initiates processing of the doorbell data.  There are 6 types of
 *    doorbells in Tavor.
 *
 *    "Send Doorbell" for synchronizing the attachment of a WQE (or a chain
 *	of WQEs) to the send queue.
 *    "RD Send Doorbell" (Same as above, except for RD QPs) is not supported.
 *    "Receive Doorbell" for synchronizing the attachment of a WQE (or a chain
 *	of WQEs) to the receive queue.
 *    "CQ Doorbell" for updating the CQ consumer index and requesting
 * 	completion notifications.
 *    "EQ Doorbell" for updating the EQ consumer index, arming interrupt
 *	triggering, and disarming CQ notification requests.
 *    "InfiniBlast" (which would have enabled access to the "InfiniBlast
 *	buffer") is not supported.
 *
 *    Note: The tavor_hw_uar_t below is the container for all of the various
 *    doorbell types.  Below we first define several structures which make up
 *    the contents of those doorbell types.
 *
 *    Note also: The following structures are not #define'd with both little-
 *    endian and big-endian definitions.  This is because each doorbell type
 *    is not directly accessed except through a single ddi_put64() operation
 *    (see tavor_qp_send_doorbell, tavor_qp_recv_doorbell, tavor_cq_doorbell,
 *    or tavor_eq_doorbell)
 */

/*
 * Send doorbell register structure
 */
typedef struct mcxnex_hw_send_db_reg_s {
	uint32_t			:32;

	uint32_t	snd_q_num	:24;
	uint32_t			:8;
} mcxnex_hw_send_db_reg_t;

#define	MCXNEX_QPSNDDB_QPN_SHIFT		0x8

/* Max descriptors per Mcxnex doorbell */
#define	MCXNEX_QP_MAXDESC_PER_DB		256

/*
 * CQ doorbell register structure
 */
typedef struct mcxnex_hw_cq_db_reg_s {
	uint32_t			:2;
	uint32_t	cmd_sn		:2;
	uint32_t			:2;
	uint32_t	cmd		:2;
	uint32_t	cqn		:24;

	uint32_t			:8;
	/* consumer cntr of last polled completion */
	uint32_t	cq_ci		:24;
} mcxnex_hw_cq_db_reg_t;

#define	MCXNEX_CQDB_CMD_SHIFT		0x18	/* dec 24 */
#define	MCXNEX_CQDB_CMDSN_SHIFT		0x1C	/* dec 28 */


#define	MCXNEX_CQDB_NOTIFY_CQ		0x02
#define	MCXNEX_CQDB_NOTIFY_CQ_SOLICIT	0x01

/* Default value for use in NOTIFY_CQ doorbell */
#define	MCXNEX_CQDB_DEFAULT_PARAM	0xFFFFFFFF

typedef struct mcxnex_hw_guest_eq_ci_s {	/* guest op eq consumer index */
	uint32_t	armed		:1;
	uint32_t			:7;
	uint32_t	guestos_ci	:24;

	uint32_t			:32;
} mcxnex_hw_guest_eq_ci_t;



/*
 * UAR page structure, containing all doorbell registers
 */
struct mcxnex_hw_uar_s {
	uint32_t		rsrv0[4];

	mcxnex_hw_send_db_reg_t	send;

	uint32_t		rsrv1[2];

	mcxnex_hw_cq_db_reg_t	cq;

	uint32_t		rsrv2[502];	/* next is at offset 0x800 */

	mcxnex_hw_guest_eq_ci_t	g_eq0;
	mcxnex_hw_guest_eq_ci_t	g_eq1;
	mcxnex_hw_guest_eq_ci_t	g_eq2;
	mcxnex_hw_guest_eq_ci_t	g_eq3;

	uint32_t		rsrv3[504];	/* end of page */
};

/*
 * QP (RQ, SRQ) doorbell record-specific data
 *	Note that this structure is NOT in ICM, but just kept in host memory
 *	and managed independently of PRM or other constraints.  Also, though
 *	the qp/srq doorbell need to be only 4 bytes, it is 8 bytes in memory for
 *	ease of management.  Mcxnex defines its usage in the QP chapter.
 */
typedef struct mcxnex_hw_qp_db_s {
	uint32_t			:16;
	uint32_t	rcv_wqe_cntr	:16;	/* wqe_counter */

	uint32_t			:32;
} mcxnex_hw_qp_db_t;

