Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_hw.h
/*
 * CQ (ARM and SET_CI) doorbell record-specific data
 *	See comment above re: QP doorbell.  This dbr is 8 bytes long, and its
 *	usage is defined in PRM chapter on Completion Queues
 */
typedef struct mcxnex_hw_cq_arm_db_s {
	uint32_t			:8;
	uint32_t	update_ci	:24;

	uint32_t			:2;
	/* sequence number of the doorbell ring % 4 */
	uint32_t	cmd_sn		:2;
	uint32_t			:1;
	uint32_t	cmd		:3;	/* command */
	uint32_t	cq_ci		:24;
} mcxnex_hw_cq_db_t;

#define	MCXNEX_CQ_DB_CMD_SOLICTED	0x01
#define	MCXNEX_CQ_DB_CMD_NEXT		0x02


/*
 * Mcxnex Blue Flame (BF)
 *	Mcxnex has the ability to do a low-latency write of successive WQEs
 * 	for the HCA.  This utilizes part of the memory area behind the
 *	same BAR as the UAR page (see above) - half the area is devoted to
 *	UAR pages, the other half to BlueFlame (though in fairness, the return
 * 	information from QUERY_DEV_CAP should be consulted _in case_ they ever
 *	decide to change it.
 *
 *	We define the structures to access them below.
 */


/*
 * Mcxnex Send Work Queue Element (WQE)
 *    A Mcxnex Send WQE is built of the following segments, each of which is a
 *    multiple of 16 bytes.  Note: Each individual WQE may contain only a
 *    subset of these segments described below (according to the operation type
 *    and transport type of the QP).
 *
 *    The first 16 bytes of ever WQE are formed from the "Ctrl" segment.
 *    This segment contains the address of the next WQE to be executed and the
 *    information required in order to allocate the resources to execute the
 *    next WQE.  The "Ctrl" part of this segment contains the control
 *    information required to execute the WQE, including the opcode and other
 *    control information.
 *    The "Datagram" segment contains address information required in order to
 *    form a UD message.
 *    The "Bind" segment contains the parameters required for a Bind Memory
 *    Window operation.
 *    The "Remote Address" segment is present only in RDMA or Atomic WQEs and
 *    specifies remote virtual addresses and RKey, respectively.  Length of
 *    the remote access is calculated from the scatter/gather list (for
 *    RDMA-write/RDMA-read) or set to eight (for Atomic).
 *    The "Atomic" segment is present only in Atomic WQEs and specifies
 *    Swap/Add and Compare data.
 *
 *    Note: The following structures are not #define'd with both little-endian
 *    and big-endian definitions.  This is because their individual fields are
 *    not directly accessed except through macros defined below.
 */


struct mcxnex_hw_snd_wqe_ctrl_s {
	uint32_t	owner		:1;
	/* NOTE: some/many may be used by enet */
	uint32_t			:26;
	uint32_t	opcode		:5;
	/* NOTE: some will be used by enet */
	uint32_t			:25;
	uint32_t	fence		:1;
	/* WQE size in octowords */
	uint32_t	ds		:6;
	/* SRC remote buffer if impl */
	uint32_t	src_rem_buf	:24;
	uint32_t	so		:1;
	uint32_t			:1;	/* FCoIB only */
	uint32_t	tcp_udp		:1;	/* Checksumming */
	uint32_t	ip		:1;	/* Checksumming */
	uint32_t	cq_gen		:2;	/* 00=no cqe, 11= gen cqe */
	/* set means solicit bit in last packet */
	uint32_t	s		:1;
	uint32_t	force_lb	:1;

	uint32_t	immediate	:32;
};

struct mcxnex_hw_srq_wqe_next_s {
	uint32_t			:16;
	uint32_t	next_wqe_idx	:16;

	uint32_t	rsvd[3];
};


#define	MCXNEX_WQE_SEND_FENCE_MASK	0x40

#define	MCXNEX_WQE_SEND_NOPCODE_NOP	0x00
#define	MCXNEX_WQE_SEND_NOPCODE_SND_INV 0x01
#define	MCXNEX_WQE_SEND_NOPCODE_RDMAW	0x8
#define	MCXNEX_WQE_SEND_NOPCODE_RDMAWI	0x9
#define	MCXNEX_WQE_SEND_NOPCODE_SEND	0xA
#define	MCXNEX_WQE_SEND_NOPCODE_SENDI	0xB
#define	MCXNEX_WQE_SEND_NOPCODE_LSO	0xE
#define	MCXNEX_WQE_SEND_NOPCODE_RDMAR	0x10
#define	MCXNEX_WQE_SEND_NOPCODE_ATMCS	0x11
#define	MCXNEX_WQE_SEND_NOPCODE_ATMFA	0x12
#define	MCXNEX_WQE_SEND_NOPCODE_ATMCSE 0x14
#define	MCXNEX_WQE_SEND_NOPCODE_ATMFAE 0x15
#define	MCXNEX_WQE_SEND_NOPCODE_BIND	0x18
#define	MCXNEX_WQE_SEND_NOPCODE_FRWR	0x19
#define	MCXNEX_WQE_SEND_NOPCODE_LCL_INV 0x1B
#define	MCXNEX_WQE_SEND_NOPCODE_CONFIG 0x1F		/* for ccq only */

#define	MCXNEX_WQE_SEND_SIGNALED_MASK	0x0000000C00000000ull
#define	MCXNEX_WQE_SEND_SOLICIT_MASK	0x0000000200000000ull
#define	MCXNEX_WQE_SEND_IMMEDIATE_MASK	0x0000000100000000ull

struct mcxnex_hw_snd_wqe_ud_s {
	struct mcxnex_hw_udav_s		ud_addr_v;

	uint32_t			:8;
	uint32_t	dest_qp		:24;
	uint32_t	qkey		:32;
	uint32_t			:32;
	uint32_t			:32;
};
#define	MCXNEX_WQE_SENDHDR_UD_AV_MASK	0xFFFFFFFFFFFFFFE0ull
#define	MCXNEX_WQE_SENDHDR_UD_DQPN_MASK	0xFFFFFF

struct mcxnex_hw_snd_wqe_bind_s {
	uint32_t	ae		:1;
	uint32_t	rw		:1;
	uint32_t	rr		:1;
	uint32_t			:3;
	uint32_t	l_64		:1;
	uint32_t			:25;

	uint32_t	win_t		:1;
	uint32_t	z_base		:1;
	uint32_t			:30;

	uint32_t	new_rkey;
	uint32_t	reg_lkey;
	uint64_t	addr;
	uint64_t	len;
};
#define	MCXNEX_WQE_SENDHDR_BIND_ATOM	0x8000000000000000ull
#define	MCXNEX_WQE_SENDHDR_BIND_WR	0x4000000000000000ull
#define	MCXNEX_WQE_SENDHDR_BIND_RD	0x2000000000000000ull

struct mcxnex_hw_snd_wqe_remaddr_s {
	uint64_t	vaddr;
	uint32_t	rkey;
	uint32_t			:32;
};

struct mcxnex_hw_snd_wqe_atomic_s {
	uint64_t	swap_add;
	uint64_t	compare;
};

struct mcxnex_hw_snd_wqe_atomic_ext_s {
	uint64_t	swap_add;
	uint64_t	compare;
	uint64_t	swapmask;
	uint64_t	cmpmask;
};



struct mcxnex_hw_snd_wqe_local_inv_s {
	uint32_t			:6;
	uint32_t	atc_shoot	:1;
	uint32_t			:25;

	uint32_t			:32;

	uint32_t	mkey;

	uint32_t			:25;
	uint32_t	guest_id	:7;	/* for atc shootdown */

	uint32_t	rsrv0[6];

	uint32_t	p_addrh;
	uint32_t	p_addrl		:23;
	uint32_t			:9;
};

struct mcxnex_hw_snd_wqe_frwr_s {
	uint32_t	rem_atomic	:1;
	uint32_t	rem_write	:1;
	uint32_t	rem_read	:1;
	uint32_t	loc_write	:1;
	uint32_t	loc_read	:1;
	uint32_t	fbo_en		:1;
	uint32_t	len_64		:1;
	uint32_t			:3;	/* but some for FCoIB */
	uint32_t	bind_en		:1;
	uint32_t	blk_pg_mode	:1;
	uint32_t	mtt_rep		:4;
	uint32_t			:16;

	uint32_t	mkey;		/* swapped w/ addrh relative to arbel */

	uint32_t	pbl_addrh;

	uint32_t	pbl_addrl	:26;
	uint32_t			:6;

	uint64_t	start_addr;

	uint64_t	reg_len;	/* w/ len_64 allows 65 bits of length */

	uint32_t			:11;
	uint32_t	fbo		:21;

	uint32_t			:11;
	uint32_t	pge_blk_sz	:21;

	uint32_t	rsrv0[2];
};

