Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_hw.h
/*
 * NOTE:  Some mcxnex-PRM defined Send WQE segments are not defined here
 *	because they will not be used initially:  they should be added and
 *	used later on:
 * 		FCP-3 init
 *		FCP-3 Control
 *		Large Send Offload
 *
 */

/*
 * Mcxnex "MLX transport" Work Queue Element (WQE)
 *    The format of the MLX WQE is similar to that of the Send WQE (above)
 *    with the following exceptions.  MLX WQEs are used for sending MADs on
 *    special QPs 0 and 1.  Everything following the "Next/Ctrl" header
 *    (defined below) consists of scatter-gather list entries.  The contents
 *    of these SGLs (also defined below) will be put on the wire exactly as
 *    they appear in the buffers.  In addition, the VCRC and the ICRC of each
 *    sent packet can be modified by changing values in the following header
 *    or in the payload of the packet itself.
 */


struct mcxnex_hw_mlx_wqe_nextctrl_s {
	uint32_t	owner		:1;
	uint32_t			:23;
	uint32_t			:3;
	uint32_t	opcode		:5;	/* is 0x0A (send) for MLX */

	uint32_t			:26;
	uint32_t	ds		:6;	/* WQE size in octowords */

	uint32_t			:14;
	uint32_t	vl15		:1;
	uint32_t	slr		:1;
	uint32_t	max_srate	:4;
	uint32_t	sl		:4;
	uint32_t			:3;	/* FCoIB usage */
	uint32_t	icrc		:1;	/* 1==don't replace icrc fld */
	uint32_t	cq_gen		:2;	/* 00= no cqe, 11==cqe */
	uint32_t			:1;
	uint32_t	force_lb	:1;

	uint32_t	rlid		:16;
	uint32_t			:16;
};


#define	MCXNEX_WQE_MLXHDR_VL15_MASK	0x0002000000000000ull
#define	MCXNEX_WQE_MLXHDR_SLR_MASK	0x0001000000000000ull
#define	MCXNEX_WQE_MLXHDR_SRATE_SHIFT	44
#define	MCXNEX_WQE_MLXHDR_SL_SHIFT	40
#define	MCXNEX_WQE_MLXHDR_SIGNALED_MASK	0x0000000800000000ull
#define	MCXNEX_WQE_MLXHDR_RLID_SHIFT	16


/*
 * Mcxnex Receive Work Queue Element (WQE)
 *    Unlike the Send WQE, the Receive WQE is built ONLY of 16-byte segments. A
 *    "Next/Ctrl" segment is no longer needed, because of the fixed
 *	receive queue stride (RQ.STRIDE).  It contains just
 *    some number of scatter list entries for the incoming message.
 *
 *    The format of the scatter-gather list entries is shown below.  For
 *    Receive WQEs the "inline_data" field must be cleared (i.e. data segments
 *    cannot contain inline data).
 */


struct mcxnex_hw_wqe_sgl_s {
	uint32_t	inline_data	:1;
	uint32_t	byte_cnt	:31;

	uint32_t	lkey;

	uint64_t	addr;
};
#define	MCXNEX_WQE_SGL_BYTE_CNT_MASK	0x7FFFFFFF
#define	MCXNEX_WQE_SGL_INLINE_MASK	0x80000000

/*
 * The following defines are used when building descriptors for special QP
 * work requests (i.e. MLX transport WQEs).  Note: Because Mcxnex MLX transport
 * requires the driver to build actual IB packet headers, we use these defines
 * for the most common fields in those headers.
 */


#define	MCXNEX_MLX_VL15_LVER		0xF0000000
#define	MCXNEX_MLX_VL0_LVER		0x00000000
#define	MCXNEX_MLX_IPVER_TC_FLOW	0x60000000
#define	MCXNEX_MLX_TC_SHIFT		20
#define	MCXNEX_MLX_DEF_PKEY		0xFFFF
#define	MCXNEX_MLX_GSI_QKEY		0x80010000
#define	MCXNEX_MLX_UDSEND_OPCODE	0x64000000
#define	MCXNEX_MLX_DQPN_MASK		0xFFFFFF

/*
 * The following macros are used for building each of the individual
 * segments that can make up a Mcxnex WQE.  Note: We try not to use the
 * structures (with their associated bitfields) here, instead opting to
 * build and put 64-bit or 32-bit chunks to the WQEs as appropriate,
 * primarily because using the bitfields appears to force more read-modify-
 * write operations.
 *
 *    MCXNEX_WQE_BUILD_UD		- Builds Unreliable Datagram Segment
 *
 *    MCXNEX_WQE_BUILD_REMADDR		- Builds Remote Address Segment using
 *					    RDMA info from the work request
 *    MCXNEX_WQE_BUILD_RC_ATOMIC_REMADDR	- Builds Remote Address Segment
 *					    for RC Atomic work requests
 *    MCXNEX_WQE_BUILD_ATOMIC		- Builds Atomic Segment using atomic
 *					    info from the work request
 *    MCXNEX_WQE_BUILD_BIND		- Builds the Bind Memory Window
 *					    Segment using bind info from the
 *					    work request
 *    MCXNEX_WQE_BUILD_DATA_SEG		- Builds the individual Data Segments
 *					    for Send, Receive, and MLX WQEs
 *    MCXNEX_WQE_BUILD_INLINE		- Builds an "inline" Data Segment
 *					    (primarily for MLX transport)
 *    MCXNEX_WQE_BUILD_INLINE_ICRC	- Also builds an "inline" Data Segment
 *					    (but used primarily in the ICRC
 *					    portion of MLX transport WQEs)
 *    MCXNEX_WQE_LINKNEXT		- Links the current WQE to the
 *					    previous one
 *    MCXNEX_WQE_LINKFIRST		- Links the first WQE on the current
 *					    chain to the previous WQE
 *    MCXNEX_WQE_BUILD_MLX_LRH		- Builds the inline LRH header for
 *					    MLX transport MADs
 *    MCXNEX_WQE_BUILD_MLX_GRH		- Builds the inline GRH header for
 *					    MLX transport MADs
 *    MCXNEX_WQE_BUILD_MLX_BTH		- Builds the inline BTH header for
 *					    MLX transport MADs
 *    MCXNEX_WQE_BUILD_MLX_DETH		- Builds the inline DETH header for
 *					    MLX transport MADs
 */
#define	MCXNEX_WQE_BUILD_UD(qp, ud, ah, dest)				\
{									\
	uint64_t		*tmp;					\
	uint64_t		*udav;					\
									\
	tmp	= (uint64_t *)(ud);					\
	udav	= (uint64_t *)(ah)->ah_udav;				\
	tmp[0]	= ntohll(udav[0]);					\
	tmp[1]	= ntohll(udav[1]);					\
	tmp[2]	= ntohll(udav[2]);					\
	tmp[3]	= ntohll(udav[3]);					\
	tmp[4]	= ntohll((((uint64_t)((dest)->ud_dst_qpn &		\
	    MCXNEX_WQE_SENDHDR_UD_DQPN_MASK) << 32) |			\
	    (dest)->ud_qkey));						\
	tmp[5] = 0;							\
}

#define	MCXNEX_WQE_BUILD_LSO(qp, ds, mss, hdr_sz)			\
	*(uint32_t *)(ds) = htonl(((mss) << 16) | hdr_sz);

#define	MCXNEX_WQE_BUILD_REMADDR(qp, ra, wr_rdma)			\
{									\
	uint64_t		*tmp;					\
									\
	tmp	= (uint64_t *)(ra);					\
	tmp[0] = htonll((wr_rdma)->rdma_raddr);				\
	tmp[1] = htonll((uint64_t)(wr_rdma)->rdma_rkey << 32);		\
}

#define	MCXNEX_WQE_BUILD_RC_ATOMIC_REMADDR(qp, rc, wr)	\
{									\
	uint64_t		*tmp;					\
									\
	tmp	= (uint64_t *)(rc);					\
	tmp[0] = htonll((wr)->wr.rc.rcwr.atomic->atom_raddr);		\
	tmp[1] = htonll((uint64_t)(wr)->wr.rc.rcwr.atomic->atom_rkey << 32); \
}

#define	MCXNEX_WQE_BUILD_ATOMIC(qp, at, wr_atom)		\
{									\
	uint64_t		*tmp;					\
									\
	tmp	= (uint64_t *)(at);					\
	tmp[0] = htonll((wr_atom)->atom_arg2);				\
	tmp[1] = htonll((wr_atom)->atom_arg1);				\
}

#define	MCXNEX_WQE_BUILD_BIND(qp, bn, wr_bind)			\
{									\
	uint64_t		*tmp;					\
	uint64_t		bn0_tmp;				\
	ibt_bind_flags_t	bind_flags;				\
									\
	tmp	   = (uint64_t *)(bn);					\
	bind_flags = (wr_bind)->bind_flags;				\
	bn0_tmp	   = (bind_flags & IBT_WR_BIND_ATOMIC) ?		\
	    MCXNEX_WQE_SENDHDR_BIND_ATOM : 0;				\
	bn0_tmp	  |= (bind_flags & IBT_WR_BIND_WRITE) ?			\
	    MCXNEX_WQE_SENDHDR_BIND_WR : 0;				\
	bn0_tmp	  |= (bind_flags & IBT_WR_BIND_READ) ?			\
	    MCXNEX_WQE_SENDHDR_BIND_RD : 0;				\
	tmp[0] = htonll(bn0_tmp);					\
	tmp[1] = htonll(((uint64_t)(wr_bind)->bind_rkey_out << 32) |	\
	    (wr_bind)->bind_lkey);					\
	tmp[2] = htonll((wr_bind)->bind_va);				\
	tmp[3] = htonll((wr_bind)->bind_len);				\
}

#define	MCXNEX_WQE_BUILD_DATA_SEG_RECV(ds, sgl)		\
{									\
	uint64_t		*tmp;					\
									\
	tmp	= (uint64_t *)(ds);					\
	tmp[0] = htonll((((uint64_t)((sgl)->ds_len & \
	    MCXNEX_WQE_SGL_BYTE_CNT_MASK) << 32) | (sgl)->ds_key));	\
	tmp[1] = htonll((sgl)->ds_va); \
}
#define	MCXNEX_WQE_BUILD_DATA_SEG_SEND(ds, sgl)		\
{									\
	((uint64_t *)(ds))[1] = htonll((sgl)->ds_va);			\
	((uint32_t *)(ds))[1] = htonl((sgl)->ds_key);			\
	membar_producer();						\
	((uint32_t *)(ds))[0] =						\
	    htonl((sgl)->ds_len & MCXNEX_WQE_SGL_BYTE_CNT_MASK);	\
}

#define	MCXNEX_WQE_BUILD_INLINE(qp, ds, sz)				\
	*(uint32_t *)(ds) = htonl(MCXNEX_WQE_SGL_INLINE_MASK | (sz))

