Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_hw.h
#define	MCXNEX_WQE_BUILD_INLINE_ICRC(qp, ds, sz, icrc)	\
{									\
	uint32_t		*tmp;					\
									\
	tmp = (uint32_t *)(ds);						\
	tmp[0] = htonl(MCXNEX_WQE_SGL_INLINE_MASK | (sz));		\
	tmp[1] = htonl(icrc);						\
}

#define	MCXNEX_WQE_SET_CTRL_SEGMENT(desc, desc_sz, fence,	 	\
		imm, sol, sig, ip_cksum, qp)				\
{									\
	uint32_t		*tmp;					\
	uint32_t		cntr_tmp;				\
									\
	/* do not set the first dword (owner/opcode) here */		\
	tmp = (uint32_t *)desc;						\
	cntr_tmp = (fence << 6) | desc_sz;				\
	tmp[1] = ntohl(cntr_tmp); 					\
	cntr_tmp = 0;							\
	if ((sol) != 0) cntr_tmp |= 0x02;				\
	if ((sig) != 0) cntr_tmp |= 0x0C;				\
	/*LINTED*/							\
	if (ip_cksum) cntr_tmp |= 0x30;					\
	tmp[2] = ntohl(cntr_tmp); 					\
	tmp[3] = ntohl(imm);						\
}

#define	MCXNEX_WQE_SET_MLX_CTRL_SEGMENT(desc, desc_sz, sig, maxstat, 	\
		lid, qp, sl)						\
{									\
	uint32_t		*tmp;					\
	uint32_t		cntr_tmp;				\
									\
	tmp = (uint32_t *)desc;						\
	cntr_tmp = htonl(tmp[0]);					\
	cntr_tmp &= 0x80000000;						\
	cntr_tmp |= MCXNEX_WQE_SEND_NOPCODE_SEND;			\
	tmp[0] = ntohl(cntr_tmp);					\
	tmp[1] = ntohl(desc_sz);					\
	cntr_tmp = ((maxstat << 4) | (sl & 0xff)) << 8;			\
	if (qp->qp_is_special == MCXNEX_QP_SMI)				\
		cntr_tmp |= (0x02 << 16);				\
	if (lid == IB_LID_PERMISSIVE)					\
		cntr_tmp |= (0x01 << 16);				\
	if ((sig) != 0)							\
		cntr_tmp |= 0xC;					\
	tmp[2] = ntohl(cntr_tmp);					\
	tmp[3] = ntohl((lid) << 16);					\
}

#define	MCXNEX_WQE_BUILD_MLX_LRH(lrh, qp, udav, pktlen)	\
{									\
	uint32_t		*tmp;					\
	uint32_t		lrh_tmp;				\
									\
	tmp	 = (uint32_t *)(void *)(lrh);				\
									\
	if ((qp)->qp_is_special == MCXNEX_QP_SMI) {			\
		lrh_tmp = MCXNEX_MLX_VL15_LVER;				\
	} else {							\
		lrh_tmp = MCXNEX_MLX_VL0_LVER | ((udav)->sl << 20);	\
	}								\
	if ((udav)->grh) {						\
		lrh_tmp |= (IB_LRH_NEXT_HDR_GRH << 16);			\
	} else {							\
		lrh_tmp |= (IB_LRH_NEXT_HDR_BTH << 16);			\
	}								\
	lrh_tmp |= (udav)->rlid;					\
	tmp[0] = htonl(lrh_tmp);					\
									\
	lrh_tmp	 = (pktlen) << 16;					\
	if ((udav)->rlid == IB_LID_PERMISSIVE) {			\
		lrh_tmp |= IB_LID_PERMISSIVE;				\
	} else {							\
		lrh_tmp |= (udav)->ml_path;				\
	}								\
	tmp[1] = htonl(lrh_tmp);					\
}

/*
 * Note: The GRH payload length, calculated below, is the overall packet
 * length (in bytes) minus LRH header and GRH headers.
 *
 * Also note: Filling in the GIDs in the way we do below is helpful because
 * it avoids potential alignment restrictions and/or conflicts.
 */
#define	MCXNEX_WQE_BUILD_MLX_GRH(state, grh, qp, udav, pktlen)	\
{									\
	uint32_t		*tmp;					\
	uint32_t		grh_tmp;				\
	ib_gid_t		sgid;					\
									\
	tmp	 = (uint32_t *)(grh);					\
									\
	grh_tmp	 = MCXNEX_MLX_IPVER_TC_FLOW;				\
	grh_tmp |= (udav)->tclass << MCXNEX_MLX_TC_SHIFT;		\
	grh_tmp |= (udav)->flow_label;					\
	tmp[0] = htonl(grh_tmp);					\
									\
	grh_tmp	 = (((pktlen) << 2) - (sizeof (ib_lrh_hdr_t) +		\
	    sizeof (ib_grh_t))) << 16;					\
	grh_tmp |= (IB_GRH_NEXT_HDR_BTH << 8);				\
	grh_tmp |= (udav)->hop_limit;					\
	tmp[1] = htonl(grh_tmp);					\
									\
	sgid.gid_prefix = (state)->hs_sn_prefix[(qp)->qp_portnum];	\
	sgid.gid_guid = (state)->hs_guid[(qp)->qp_portnum]		\
	    [(udav)->mgid_index];					\
	bcopy(&sgid, &tmp[2], sizeof (ib_gid_t));			\
	bcopy(&(udav)->rgid_h, &tmp[6], sizeof (ib_gid_t));		\
}

#define	MCXNEX_WQE_BUILD_MLX_BTH(state, bth, qp, wr)		\
{									\
	uint32_t		*tmp;					\
	uint32_t		bth_tmp;				\
									\
	tmp	 = (uint32_t *)(bth);					\
									\
	bth_tmp	 = MCXNEX_MLX_UDSEND_OPCODE;				\
	if ((wr)->wr_flags & IBT_WR_SEND_SOLICIT) {			\
		bth_tmp |= (IB_BTH_SOLICITED_EVENT_MASK << 16);		\
	}								\
	if (qp->qp_is_special == MCXNEX_QP_SMI) {			\
		bth_tmp |= MCXNEX_MLX_DEF_PKEY;				\
	} else {							\
		bth_tmp |= (state)->hs_pkey[(qp)->qp_portnum]		\
		    [(qp)->qp_pkeyindx];				\
	}								\
	tmp[0] = htonl(bth_tmp);					\
	tmp[1] = htonl((wr)->wr.ud.udwr_dest->ud_dst_qpn &		\
	    MCXNEX_MLX_DQPN_MASK);					\
	tmp[2] = 0x0;							\
}

#define	MCXNEX_WQE_BUILD_MLX_DETH(deth, qp)			\
{									\
	uint32_t		*tmp;					\
									\
	tmp	 = (uint32_t *)(deth);					\
									\
	if ((qp)->qp_is_special == MCXNEX_QP_SMI) {			\
		tmp[0] = 0x0;						\
		tmp[1] = 0x0;						\
	} else {							\
		tmp[0] = htonl(MCXNEX_MLX_GSI_QKEY);			\
		tmp[1] = htonl(0x1);					\
	}								\
}






/*
 * Flash interface:
 *    Below we have PCI config space space offsets for flash interface
 *    access, offsets within Mcxnex CR space for accessing flash-specific
 *    information or settings, masks used for flash settings, and
 *    timeout values for flash operations.
 */
#define	MCXNEX_HW_FLASH_CFG_HWREV			8
#define	MCXNEX_HW_FLASH_CFG_ADDR			88
#define	MCXNEX_HW_FLASH_CFG_DATA			92

#define	MCXNEX_HW_FLASH_RESET_AMD			0xF0
#define	MCXNEX_HW_FLASH_RESET_INTEL		0xFF
#define	MCXNEX_HW_FLASH_CPUMODE			0xF0150
#define	MCXNEX_HW_FLASH_ADDR			0xF01A4
#define	MCXNEX_HW_FLASH_DATA			0xF01A8
#define	MCXNEX_HW_FLASH_GPIO_SEMA		0xF03FC
#define	MCXNEX_HW_FLASH_WRCONF_SEMA		0xF0380
#define	MCXNEX_HW_FLASH_GPIO_DATA			0xF0040
#define	MCXNEX_HW_FLASH_GPIO_MOD1			0xF004C
#define	MCXNEX_HW_FLASH_GPIO_MOD0			0xF0050
#define	MCXNEX_HW_FLASH_GPIO_DATACLEAR		0xF00D4
#define	MCXNEX_HW_FLASH_GPIO_DATASET		0xF00DC
#define	MCXNEX_HW_FLASH_GPIO_LOCK		0xF0048
#define	MCXNEX_HW_FLASH_GPIO_UNLOCK_VAL		0xD42F
#define	MCXNEX_HW_FLASH_GPIO_PIN_ENABLE		0x1E000000

#define	MCXNEX_HW_FLASH_CPU_MASK			0xC0000000
#define	MCXNEX_HW_FLASH_CPU_SHIFT		30
#define	MCXNEX_HW_FLASH_ADDR_MASK		0x0007FFFC
#define	MCXNEX_HW_FLASH_CMD_MASK			0xE0000000
#define	MCXNEX_HW_FLASH_BANK_MASK		0xFFF80000

#define	MCXNEX_HW_FLASH_SPI_BUSY			0x40000000
#define	MCXNEX_HW_FLASH_SPI_WIP			0x01000000
#define	MCXNEX_HW_FLASH_SPI_READ_OP		0x00000001
#define	MCXNEX_HW_FLASH_SPI_USE_INSTR		0x00000040
#define	MCXNEX_HW_FLASH_SPI_NO_ADDR		0x00000020
#define	MCXNEX_HW_FLASH_SPI_NO_DATA		0x00000010
#define	MCXNEX_HW_FLASH_SPI_TRANS_SZ_4B		0x00000200

#define	MCXNEX_HW_FLASH_SPI_SECTOR_ERASE		0xD8
#define	MCXNEX_HW_FLASH_SPI_READ		0x03
#define	MCXNEX_HW_FLASH_SPI_PAGE_PROGRAM		0x02
#define	MCXNEX_HW_FLASH_SPI_READ_STATUS_REG	0x05
#define	MCXNEX_HW_FLASH_SPI_WRITE_ENABLE		0x06
#define	MCXNEX_HW_FLASH_SPI_READ_ESIGNATURE	0xAB

#define	MCXNEX_HW_FLASH_SPI_GW			0xF0400
#define	MCXNEX_HW_FLASH_SPI_ADDR			0xF0404
#define	MCXNEX_HW_FLASH_SPI_DATA			0xF0410
#define	MCXNEX_HW_FLASH_SPI_DATA4		0xF0414
#define	MCXNEX_HW_FLASH_SPI_DATA8		0xF0418
#define	MCXNEX_HW_FLASH_SPI_DATA12		0xF041C
#define	MCXNEX_HW_FLASH_SPI_ADDR_MASK		0x00FFFFFF
#define	MCXNEX_HW_FLASH_SPI_INSTR_PHASE_OFF	0x04
#define	MCXNEX_HW_FLASH_SPI_ADDR_PHASE_OFF	0x08
#define	MCXNEX_HW_FLASH_SPI_DATA_PHASE_OFF	0x10
#define	MCXNEX_HW_FLASH_SPI_ENABLE_OFF		0x2000
#define	MCXNEX_HW_FLASH_SPI_CS_OFF		0x800
#define	MCXNEX_HW_FLASH_SPI_INSTR_OFF		0x10000
#define	MCXNEX_HW_FLASH_SPI_INSTR_SHIFT		0x10
#define	MCXNEX_HW_FLASH_SPI_BOOT_ADDR_REG	0xF0000

#define	MCXNEX_HW_FLASH_TIMEOUT_WRITE		300
#define	MCXNEX_HW_FLASH_TIMEOUT_ERASE		1000000
#define	MCXNEX_HW_FLASH_TIMEOUT_GPIO_SEMA	1000
#define	MCXNEX_HW_FLASH_TIMEOUT_CONFIG		50

#define	MCXNEX_HW_FLASH_ICS_ERASE		0x20
#define	MCXNEX_HW_FLASH_ICS_ERROR		0x3E
#define	MCXNEX_HW_FLASH_ICS_WRITE		0x40
#define	MCXNEX_HW_FLASH_ICS_STATUS		0x70
#define	MCXNEX_HW_FLASH_ICS_READY		0x80
#define	MCXNEX_HW_FLASH_ICS_CONFIRM		0xD0
#define	MCXNEX_HW_FLASH_ICS_READ			0xFF

#ifdef __cplusplus
}
#endif

#endif	/* _MCXNEX_HW_H */
